renesas/ArduinoCore-rl78g23_fpb_128p/variants/g23-fpb-128p/pins_variant.h
/*
  Copyright (c) 2014-2016 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _PINS_VARIANT_H_
#define _PINS_VARIANT_H_

/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/
#include <stdint.h>
#include <stdlib.h>

#ifndef configCPU_CLOCK_HZ
#define configCPU_CLOCK_HZ 					(32000000)	//!< CPUの動作周波数（RTOS未使用時に定義）
#endif

#define F_CPU (32 * 1000 * 1000L)

// G22, G23 :2 , G16:1, G24:3
#define MICROS_TIMER_DIVIDE_FACTOR ((uint32_t)2)

#define UART_CHANNEL        0       // UART0 (Serial0)
#define UART1_CHANNEL       1       // UARTA1(Serial1)
#define UART2_CHANNEL       2       // UART2 (Serial2)
#define UART3_CHANNEL       3       // UART1 (Serial3) (Rx:P03(IO17) / Tx:P02(IO16))
#define UART4_CHANNEL       4       // UART3 (Serial4)
#define UART_TOTAL_NUM 5
/* SPI(CSI) Definition */
#define USE_CSI      (1) // Set to '1' when Use SPI Hardware.

#if defined(USE_CSI) && USE_CSI

// #define CSI_CHANNEL0 (0) // USE CSI00 for SPI
// #define CSI_CHANNEL1 (1) // USE CSI01 for SPI
// #define CSI_CHANNEL2 (2) // USE CSI10 for SPI
// #define CSI_CHANNEL3 (3) // USE CSI11 for SPI
// #define CSI_CHANNEL4 (4) // USE CSI20 for SPI
#define CSI_CHANNEL6 (6) // USE CSI30 for SPI

#endif /* defined(USE_CSI) && USE_CSI */

/* IIC Definition */
#define IIC_CHANNEL0 (0)
#define IIC_CHANNEL1 (1)
// #define IIC_CHANNEL2 (2)

#if defined(G23_FPB_128P)

#define CHECK_PINMODE_INHIBIT_RL78(p) (\
    (p) == 57 || /* P21(AVREFM) */\
    (p) == 119    /* P20(AVREFP) */)

#define CHECK_OUTPUT_INHIBIT_RL78(p) ((p) == 22 || (p) == 24 || (p) == 30 || (p) == 57 || (p) == 60 || (p) == 72 || (p) == 73)

#else //G23_FPB_128 (G23_64pin)

#define CHECK_PINMODE_INHIBIT_RL78(p) (\
    (p) == 41 || /* P21(AVREFM) */\
    (p) == 14    /* P20(AVREFP) */)

#define CHECK_OUTPUT_INHIBIT_RL78(p) ((p) == 14 || (p) == 27 || (p) == 28 || (p) == 41)

#endif // G23_FPB_128

#ifdef __cplusplus
extern "C"
{

// moved from wiring_private.h
#define FREQUENCY_MIN_VAL	(500)
#define FREQUENCY_MAX_VAL	(8000000)

// #define TONE_CH_NUM				(7)

// #define TAU_OPERATION_CLOCK		(0xC000U)    /* operation clock set by PRS register */
// #define CK00_CK01_OPERATION		(0x000F)	/* Selection of operation clock CK00, CK01 */
// #define CK02_OPERATION			(0x0300)	/* Selection of operation clock CK02 */
// #define CK03_OPERATION			(0x3000)	/* Selection of operation clock CK03 */
// #define TIMEOUT_MAX_VAL			(65535)
// #define PULSE_INTERUPT			(1)

#define _4000_TAU_CLOCK_SELECT_CKM2       (0x4000U)    /* operation clock CK2 set by PRS register */
#define _0000_TAU_CKM2_FCLK_1             (0x0000U)    /* ckm2 - fCLK/2^1 */
#define _C000_TAU_CLOCK_SELECT_CKM3       (0xC000U)    /* operation clock CK3 set by PRS register */

}
#endif // __cplusplus

// tone_func

int8_t get_tone_channel(uint8_t tone_num);

typedef struct {
    void (*open)();
    void (*start)();
    void (*stop)();
    void (*get_width)(uint32_t * const width);
} pulse_in_func;
/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

#define NUM_DIGITAL_PINS            119
#define NUM_ANALOG_INPUTS           16
#define NUM_SWPWM_PINS              4
// #endif
#define analogInputToDigitalPin(p)  ((p < 6) ? (p) + 103 : -1)
#define digitalPinHasPWM(p)         ((p) == 2 || (p) == 3 || (p) == 4 || (p) == 5 || (p) == 6 || (p) == 7 || (p) == 8 || (p) == 9 || (p) == 11 || (p) == 12 || (p) == 13  )

#define PIN_SPI_SS    (85)
#define PIN_SPI_MOSI  (14)
#define PIN_SPI_MISO  (15)
#define PIN_SPI_SCK   (86)

extern const uint8_t SS;
extern const uint8_t MOSI;
extern const uint8_t MISO;
extern const uint8_t SCK;

extern const uint8_t SS3;
extern const uint8_t MOSI3;
extern const uint8_t MISO3;
extern const uint8_t SCK3;

extern const uint8_t SS4;
extern const uint8_t MOSI4;
extern const uint8_t MISO4;
extern const uint8_t SCK4;

extern const uint8_t SS5;
extern const uint8_t MOSI5;
extern const uint8_t MISO5;
extern const uint8_t SCK5;

#define PIN_WIRE_SDA0        (38) // P61
#define PIN_WIRE_SCL0        (37) // P60
#define PIN_WIRE_SDA1        (91) // P63
#define PIN_WIRE_SCL1        (90) // P62

#define BUILTIN_LED1 31
#define BUILTIN_LED2 32
#define LED_BUILTIN  BUILTIN_LED1

#define LED_ON  LOW
#define LED_OFF HIGH

#define PIN_A0   (103)
#define PIN_A1   (104)
#define PIN_A2   (105)
#define PIN_A3   (106)
#define PIN_A4   (107)
#define PIN_A5   (108)
#define PIN_A6   (109)
#define PIN_A7   (110)
#define PIN_A8   (111)
#define PIN_A9   (112)
#define PIN_A10  (113)
#define PIN_A11  (114)
#define PIN_A12  (115)
#define PIN_A13  (116)
#define PIN_A14  (117)
#define PIN_A15  (118)
extern const uint8_t A0;
extern const uint8_t A1;
extern const uint8_t A2;
extern const uint8_t A3;
extern const uint8_t A4;
extern const uint8_t A5;
extern const uint8_t A6;
extern const uint8_t A7;
extern const uint8_t A8;
extern const uint8_t A9;
extern const uint8_t A10;
extern const uint8_t A11;
extern const uint8_t A12;
extern const uint8_t A13;
extern const uint8_t A14;
extern const uint8_t A15;

#define digitalPinToInterrupt(p)  (((p) == 7) ? 0 : (((p) == 9) ? 1 : (((p) == 61) ? 2 : (((p) == 66) ? 3 : (((p) == 67) ? 4 : (((p) == 68) ? 5 : \
   (((p) == 69) ? 6 : (((p) == 87) ? 7 : (((p) == 89) ? 8 :  NOT_AN_INTERRUPT)))))))))

/***************************************************************************/
/*    Macro Definitions                                                    */
/***************************************************************************/
#define ADDR_PORT_REG			0xFFFFFF00
#define ADDR_PORT_MODE_REG		0xFFFFFF20
#define ADDR_PORT_PULL_UP_REG	0xFFFF0030
#define	ADDR_PORT_IN_MODE_REG	0xFFFF0040
#define ADDR_PORT_OUT_MODE_REG	0xFFFF0050

/* Add for G23 */
#define ADDR_PORT_MODE_CONTROL_A_REG	0xFFFF0060
#define ADDR_PORT_MODE_CONTROL_T_REG	0xFFFF0260
#define ADDR_PORT_MODE_CONTROL_E_REG	0xFFFF0280
#define ADDR_PORT_OUT_CUR_CONTROL_REG	0xFFFF02A8
#define ADDR_PORT_DIG_INPUT_DIS_REG		0xFFFF02B0
/* Add for G23 */

#define ANALOG_PIN_0		26		// ANI26
#define ANALOG_PIN_1		25		// ANI25
#define ANALOG_PIN_2		24		// ANI24
#define ANALOG_PIN_3		18		// ANI18
#define ANALOG_PIN_4		20		// ANI20
#define ANALOG_PIN_5		14		// ANI14
#define ANALOG_PIN_6		13		// ANI13
#define ANALOG_PIN_7		12		// ANI
#define ANALOG_PIN_8		11		// ANI
#define ANALOG_PIN_9		10		// ANI
#define ANALOG_PIN_10		9		// ANI
#define ANALOG_PIN_11		8		// ANI
#define ANALOG_PIN_12		7		// ANI
#define ANALOG_PIN_13		6		// ANI
#define ANALOG_PIN_14		5		// ANI
#define ANALOG_PIN_15		4		// ANI

#define ANALOG_ADPC_OFFSET	4


/* Port define. */
#define PORT_0				0
#define PORT_1				1
#define PORT_2				2
#define PORT_3				3
#define PORT_4				4
#define PORT_5				5
#define PORT_6				6
#define PORT_7				7
#define PORT_8				8
#define PORT_9				9
#define PORT_10				10
#define PORT_11				11
#define PORT_12				12
#define PORT_13				13
#define PORT_14				14
#define PORT_15				15

