renesas/ArduinoCore-rl78g23_fpb_128p/variants/g23-fpb-128p/pins_variant.h
// PORT_x means register name, so decimal name
#define DIGITAL_PIN_0		PORT_3	/* P33	*/
#define DIGITAL_PIN_1		PORT_3	/* P34	*/
#define DIGITAL_PIN_2		PORT_14	/* P145	*/
#define DIGITAL_PIN_3		PORT_10	/* P106	*/
#define DIGITAL_PIN_4		PORT_10	/* P105	*/
#define DIGITAL_PIN_5		PORT_10	/* P104	*/
#define DIGITAL_PIN_6		PORT_10	/* P103	*/
#define DIGITAL_PIN_7		PORT_4	/* P46	*/
#define DIGITAL_PIN_8		PORT_4	/* P42	*/
#define DIGITAL_PIN_9		PORT_3	/* P31	*/
#define DIGITAL_PIN_10		PORT_6	/* P64	*/
#define DIGITAL_PIN_11		PORT_6	/* P65	*/
#define DIGITAL_PIN_12		PORT_6	/* P66	*/
#define DIGITAL_PIN_13		PORT_6	/* P67	*/
#define DIGITAL_PIN_14		PORT_14	/* P144	*/
#define DIGITAL_PIN_15		PORT_14	/* P143	*/
#define DIGITAL_PIN_16		PORT_0	/* P02	*/
#define DIGITAL_PIN_17		PORT_0	/* P03	*/
#define DIGITAL_PIN_18		PORT_1	/* P13	*/
#define DIGITAL_PIN_19		PORT_1	/* P14	*/
#define DIGITAL_PIN_20		PORT_6	/* P61	*/
#define DIGITAL_PIN_21		PORT_6	/* P60	*/
#define DIGITAL_PIN_22		PORT_4	/* P40	*/
#define DIGITAL_PIN_23		PORT_8	/* P80	*/
#define DIGITAL_PIN_24		PORT_0	/* P05	*/
#define DIGITAL_PIN_25		PORT_8	/* P81	*/
#define DIGITAL_PIN_26		PORT_8	/* P82	*/
#define DIGITAL_PIN_27		PORT_8	/* P85	*/
#define DIGITAL_PIN_28		PORT_8	/* P86	*/
#define DIGITAL_PIN_29		PORT_8	/* P87	*/
#define DIGITAL_PIN_30		PORT_3	/* P30 	*/
#define DIGITAL_PIN_31		PORT_5	/* P50	*/
#define DIGITAL_PIN_32		PORT_5	/* P51	*/
#define DIGITAL_PIN_33		PORT_5	/* P52	*/
#define DIGITAL_PIN_34		PORT_5	/* P53	*/
#define DIGITAL_PIN_35		PORT_5	/* P54	*/
#define DIGITAL_PIN_36		PORT_5	/* P55	*/
#define DIGITAL_PIN_37		PORT_5	/* P56	*/
#define DIGITAL_PIN_38		PORT_5	/* P57	*/
#define DIGITAL_PIN_39		PORT_1	/* P17	*/
#define DIGITAL_PIN_40		PORT_1	/* P12	*/
#define DIGITAL_PIN_41		PORT_1	/* P11 	*/
#define DIGITAL_PIN_42		PORT_1	/* P10	*/
#define DIGITAL_PIN_43		PORT_9	/* P90 	*/
#define DIGITAL_PIN_44		PORT_9	/* P91 	*/
#define DIGITAL_PIN_45		PORT_9	/* P92	*/
#define DIGITAL_PIN_46		PORT_9	/* P93	*/
#define DIGITAL_PIN_47		PORT_9	/* P94	*/
#define DIGITAL_PIN_48		PORT_9	/* P97	*/
#define DIGITAL_PIN_49		PORT_11	/* P112	*/
#define DIGITAL_PIN_50		PORT_11	/* P113	*/
#define DIGITAL_PIN_51		PORT_11	/* P114	*/
#define DIGITAL_PIN_52		PORT_10	/* P101	*/
#define DIGITAL_PIN_53		PORT_11	/* P111	*/
#define DIGITAL_PIN_54		PORT_14	/* P146	*/
#define DIGITAL_PIN_55		PORT_2	/* P23	*/
#define DIGITAL_PIN_56		PORT_2	/* P22	*/
#define DIGITAL_PIN_57		PORT_2	/* P21	*/
#define DIGITAL_PIN_58		PORT_13	/* P130	*/
#define DIGITAL_PIN_59		PORT_10	/* P102	*/
#define DIGITAL_PIN_60		PORT_0	/* P06	*/
#define DIGITAL_PIN_61		PORT_13	/* P137	*/
#define DIGITAL_PIN_62		PORT_7	/* P70	*/
#define DIGITAL_PIN_63		PORT_7	/* P71	*/
#define DIGITAL_PIN_64		PORT_7	/* P72	*/
#define DIGITAL_PIN_65		PORT_7	/* P73	*/
#define DIGITAL_PIN_66		PORT_7	/* P74	*/
#define DIGITAL_PIN_67		PORT_7	/* P75	*/
#define DIGITAL_PIN_68		PORT_7	/* P76	*/
#define DIGITAL_PIN_69		PORT_7	/* P77	*/
#define DIGITAL_PIN_70		PORT_12	/* P121	*/
#define DIGITAL_PIN_71		PORT_12	/* P122	*/
#define DIGITAL_PIN_72		PORT_12	/* P123	*/
#define DIGITAL_PIN_73		PORT_12	/* P124	*/
#define DIGITAL_PIN_74		PORT_12	/* P125	*/
#define DIGITAL_PIN_75		PORT_12	/* P126	*/
#define DIGITAL_PIN_76		PORT_12	/* P127	*/
#define DIGITAL_PIN_77		PORT_4	/* P41	*/
#define DIGITAL_PIN_78		PORT_4	/* P45	*/
#define DIGITAL_PIN_79		PORT_3	/* P32	*/
#define DIGITAL_PIN_80		PORT_3	/* P35	*/
#define DIGITAL_PIN_81		PORT_3	/* P36	*/
#define DIGITAL_PIN_82		PORT_3	/* P37	*/
#define DIGITAL_PIN_83		PORT_12	/* P120	*/
#define DIGITAL_PIN_84		PORT_0	/* P01	*/

#define DIGITAL_PIN_85		PORT_14	/* P141	*/
#define DIGITAL_PIN_86		PORT_14	/* P142	*/
#define DIGITAL_PIN_87		PORT_14	/* P140	*/
#define DIGITAL_PIN_88		PORT_0 	/* P00	*/
#define DIGITAL_PIN_89		PORT_1 	/* P16	*/
#define DIGITAL_PIN_90		PORT_6 	/* P62	*/
#define DIGITAL_PIN_91		PORT_6 	/* P63	*/
#define DIGITAL_PIN_92		PORT_4 	/* P47	*/
#define DIGITAL_PIN_93		PORT_11	/* P110	*/
#define DIGITAL_PIN_94		PORT_0 	/* P04	*/
#define DIGITAL_PIN_95		PORT_0 	/* P07	*/
#define DIGITAL_PIN_96		PORT_1 	/* P15	*/
#define DIGITAL_PIN_97		PORT_4	/* P43	*/
#define DIGITAL_PIN_98		PORT_4	/* P44	*/
#define DIGITAL_PIN_99		PORT_9	/* P95	*/
#define DIGITAL_PIN_100		PORT_9	/* P96	*/
#define DIGITAL_PIN_101		PORT_8 	/* P84	*/
#define DIGITAL_PIN_102		PORT_8 	/* P83	*/
#define DIGITAL_PIN_103		PORT_11	/* P115	*/
#define DIGITAL_PIN_104		PORT_11	/* P116	*/
#define DIGITAL_PIN_105		PORT_11	/* P117	*/
#define DIGITAL_PIN_106		PORT_14	/* P147	*/
#define DIGITAL_PIN_107		PORT_10	/* P100	*/
#define DIGITAL_PIN_108		PORT_15	/* P156	*/
#define DIGITAL_PIN_109		PORT_15	/* P155	*/
#define DIGITAL_PIN_110		PORT_15	/* P154	*/
#define DIGITAL_PIN_111		PORT_15	/* P153	*/
#define DIGITAL_PIN_112		PORT_15	/* P152	*/
#define DIGITAL_PIN_113		PORT_15	/* P151	*/
#define DIGITAL_PIN_114		PORT_15	/* P150	*/
#define DIGITAL_PIN_115		PORT_2	/* P27	*/
#define DIGITAL_PIN_116		PORT_2	/* P26	*/
#define DIGITAL_PIN_117		PORT_2	/* P25	*/
#define DIGITAL_PIN_118		PORT_2	/* P24	*/


/* Bit Num of digital pin define */
#define DIGITAL_PIN_BIT_0		0x03	/* P33	*/
#define DIGITAL_PIN_BIT_1		0x04	/* P34	*/
#define DIGITAL_PIN_BIT_2		0x05	/* P145	*/
#define DIGITAL_PIN_BIT_3		0x06	/* P106	*/
#define DIGITAL_PIN_BIT_4		0x05	/* P105	*/
#define DIGITAL_PIN_BIT_5		0x04	/* P104	*/
#define DIGITAL_PIN_BIT_6		0x03	/* P103	*/
#define DIGITAL_PIN_BIT_7		0x06	/* P46	*/
#define DIGITAL_PIN_BIT_8		0x02	/* P42	*/
#define DIGITAL_PIN_BIT_9		0x01	/* P31	*/
#define DIGITAL_PIN_BIT_10		0x04	/* P64	*/
#define DIGITAL_PIN_BIT_11		0x05	/* P65	*/
#define DIGITAL_PIN_BIT_12		0x06	/* P66	*/
#define DIGITAL_PIN_BIT_13		0x07	/* P67	*/
#define DIGITAL_PIN_BIT_14		0x04	/* P144	*/
#define DIGITAL_PIN_BIT_15		0x03	/* P143	*/
#define DIGITAL_PIN_BIT_16		0x02	/* P02	*/
#define DIGITAL_PIN_BIT_17		0x03	/* P03	*/
#define DIGITAL_PIN_BIT_18		0x03	/* P13	*/
#define DIGITAL_PIN_BIT_19		0x04	/* P14	*/
#define DIGITAL_PIN_BIT_20		0x01	/* P61	*/
#define DIGITAL_PIN_BIT_21		0x00	/* P60	*/
#define DIGITAL_PIN_BIT_22		0x00	/* P40	*/
#define DIGITAL_PIN_BIT_23		0x00	/* P80	*/
#define DIGITAL_PIN_BIT_24		0x05	/* P05	*/
#define DIGITAL_PIN_BIT_25		0x01	/* P81	*/
#define DIGITAL_PIN_BIT_26		0x02	/* P82	*/
#define DIGITAL_PIN_BIT_27		0x05	/* P85	*/
#define DIGITAL_PIN_BIT_28		0x06	/* P86	*/
#define DIGITAL_PIN_BIT_29		0x07	/* P87	*/
#define DIGITAL_PIN_BIT_30		0x00	/* P30 	*/
#define DIGITAL_PIN_BIT_31		0x00	/* P50	*/
#define DIGITAL_PIN_BIT_32		0x01	/* P51	*/
#define DIGITAL_PIN_BIT_33		0x02	/* P52	*/
#define DIGITAL_PIN_BIT_34		0x03	/* P53	*/
#define DIGITAL_PIN_BIT_35		0x04	/* P54	*/
#define DIGITAL_PIN_BIT_36		0x05	/* P55	*/
#define DIGITAL_PIN_BIT_37		0x06	/* P56	*/
#define DIGITAL_PIN_BIT_38		0x07	/* P57	*/
#define DIGITAL_PIN_BIT_39		0x07	/* P17	*/
#define DIGITAL_PIN_BIT_40		0x02	/* P12	*/
#define DIGITAL_PIN_BIT_41		0x01	/* P11 	*/
#define DIGITAL_PIN_BIT_42		0x00	/* P10	*/
#define DIGITAL_PIN_BIT_43		0x00	/* P90 	*/
#define DIGITAL_PIN_BIT_44		0x01	/* P91 	*/
#define DIGITAL_PIN_BIT_45		0x02	/* P92	*/
#define DIGITAL_PIN_BIT_46		0x03	/* P93	*/
#define DIGITAL_PIN_BIT_47		0x04	/* P94	*/
#define DIGITAL_PIN_BIT_48		0x07	/* P97	*/
#define DIGITAL_PIN_BIT_49		0x02	/* P112	*/
#define DIGITAL_PIN_BIT_50		0x03	/* P113	*/
#define DIGITAL_PIN_BIT_51		0x04	/* P114	*/
#define DIGITAL_PIN_BIT_52		0x01	/* P101	*/
#define DIGITAL_PIN_BIT_53		0x01	/* P111	*/
#define DIGITAL_PIN_BIT_54		0x06	/* P146	*/
#define DIGITAL_PIN_BIT_55		0x03	/* P23	*/
#define DIGITAL_PIN_BIT_56		0x02	/* P22	*/
#define DIGITAL_PIN_BIT_57		0x01	/* P21	*/
#define DIGITAL_PIN_BIT_58		0x00	/* P130	*/
#define DIGITAL_PIN_BIT_59		0x02	/* P102	*/
#define DIGITAL_PIN_BIT_60		0x06	/* P06	*/
#define DIGITAL_PIN_BIT_61		0x07	/* P137	*/
#define DIGITAL_PIN_BIT_62		0x00	/* P70	*/
#define DIGITAL_PIN_BIT_63		0x01	/* P71	*/
#define DIGITAL_PIN_BIT_64		0x02	/* P72	*/
#define DIGITAL_PIN_BIT_65		0x03	/* P73	*/
#define DIGITAL_PIN_BIT_66		0x04	/* P74	*/
#define DIGITAL_PIN_BIT_67		0x05	/* P75	*/
#define DIGITAL_PIN_BIT_68		0x06	/* P76	*/
#define DIGITAL_PIN_BIT_69		0x07	/* P77	*/
#define DIGITAL_PIN_BIT_70		0x01	/* P121	*/
#define DIGITAL_PIN_BIT_71		0x02	/* P122	*/
#define DIGITAL_PIN_BIT_72		0x03	/* P123	*/
#define DIGITAL_PIN_BIT_73		0x04	/* P124	*/
#define DIGITAL_PIN_BIT_74		0x05	/* P125	*/
#define DIGITAL_PIN_BIT_75		0x06	/* P126	*/
#define DIGITAL_PIN_BIT_76		0x07	/* P127	*/
#define DIGITAL_PIN_BIT_77		0x01	/* P41	*/
#define DIGITAL_PIN_BIT_78		0x05	/* P45	*/
#define DIGITAL_PIN_BIT_79		0x02	/* P32	*/
#define DIGITAL_PIN_BIT_80		0x05	/* P35	*/
#define DIGITAL_PIN_BIT_81		0x06	/* P36	*/
#define DIGITAL_PIN_BIT_82		0x07	/* P37	*/
#define DIGITAL_PIN_BIT_83		0x00	/* P120	*/
#define DIGITAL_PIN_BIT_84		0x01	/* P01	*/
#define DIGITAL_PIN_BIT_85		0x01	/* P141	*/
#define DIGITAL_PIN_BIT_86		0x02	/* P142	*/
#define DIGITAL_PIN_BIT_87		0x00	/* P140	*/
#define DIGITAL_PIN_BIT_88		0x00	/* P00	*/
#define DIGITAL_PIN_BIT_89		0x06	/* P16	*/
#define DIGITAL_PIN_BIT_90		0x02	/* P62	*/
#define DIGITAL_PIN_BIT_91		0x03	/* P63	*/
#define DIGITAL_PIN_BIT_92		0x07	/* P47	*/
#define DIGITAL_PIN_BIT_93		0x00	/* P110	*/
#define DIGITAL_PIN_BIT_94		0x04	/* P04	*/
#define DIGITAL_PIN_BIT_95		0x07	/* P07	*/
#define DIGITAL_PIN_BIT_96		0x05	/* P15	*/
#define DIGITAL_PIN_BIT_97		0x03	/* P43	*/
#define DIGITAL_PIN_BIT_98		0x04	/* P44	*/
#define DIGITAL_PIN_BIT_99		0x05	/* P95	*/
#define DIGITAL_PIN_BIT_100		0x06	/* P96	*/
#define DIGITAL_PIN_BIT_101		0x04	/* P84	*/
#define DIGITAL_PIN_BIT_102		0x03	/* P83	*/
#define DIGITAL_PIN_BIT_103		0x05	/* P115	*/
#define DIGITAL_PIN_BIT_104		0x06	/* P116	*/
#define DIGITAL_PIN_BIT_105		0x07	/* P117	*/
#define DIGITAL_PIN_BIT_106		0x07	/* P147	*/
#define DIGITAL_PIN_BIT_107		0x00	/* P100	*/
#define DIGITAL_PIN_BIT_108		0x06	/* P156	*/
#define DIGITAL_PIN_BIT_109		0x05	/* P155	*/
#define DIGITAL_PIN_BIT_110		0x04	/* P154	*/
#define DIGITAL_PIN_BIT_111		0x03	/* P153	*/
#define DIGITAL_PIN_BIT_112		0x02	/* P152	*/
#define DIGITAL_PIN_BIT_113		0x01	/* P151	*/
#define DIGITAL_PIN_BIT_114		0x00	/* P150	*/
#define DIGITAL_PIN_BIT_115		0x07	/* P27	*/
#define DIGITAL_PIN_BIT_116		0x06	/* P26	*/
#define DIGITAL_PIN_BIT_117		0x05	/* P25	*/
#define DIGITAL_PIN_BIT_118		0x04	/* P24	*/



/* Bit mask of digital pin define. */
// Px0 -> 001, Px1 -> 0x02, Px2 -> 0x04, Px3 -> 0x08, Px4 -> 0x10, Px5 -> 0x20, Px6 -> 0x40, Px7 -> 0x80
#define DIGITAL_PIN_MASK_0		0x08	/* P33	*/
#define DIGITAL_PIN_MASK_1		0x10	/* P34	*/
#define DIGITAL_PIN_MASK_2		0x20	/* P145	*/
#define DIGITAL_PIN_MASK_3		0x40	/* P106	*/
#define DIGITAL_PIN_MASK_4		0x20	/* P105	*/
#define DIGITAL_PIN_MASK_5		0x10	/* P104	*/
#define DIGITAL_PIN_MASK_6		0x08	/* P103	*/
#define DIGITAL_PIN_MASK_7		0x40	/* P46	*/
#define DIGITAL_PIN_MASK_8		0x04	/* P42	*/
#define DIGITAL_PIN_MASK_9		0x02	/* P31	*/
#define DIGITAL_PIN_MASK_10		0x10	/* P64	*/
#define DIGITAL_PIN_MASK_11		0x20	/* P65	*/
#define DIGITAL_PIN_MASK_12		0x40	/* P66	*/
#define DIGITAL_PIN_MASK_13		0x80	/* P67	*/
#define DIGITAL_PIN_MASK_14		0x10	/* P144	*/
#define DIGITAL_PIN_MASK_15		0x08	/* P143	*/
#define DIGITAL_PIN_MASK_16		0x04	/* P02	*/
#define DIGITAL_PIN_MASK_17		0x08	/* P03	*/
#define DIGITAL_PIN_MASK_18		0x08	/* P13	*/
#define DIGITAL_PIN_MASK_19		0x10	/* P14	*/
#define DIGITAL_PIN_MASK_20		0x02	/* P61	*/
#define DIGITAL_PIN_MASK_21		0x01	/* P60	*/
#define DIGITAL_PIN_MASK_22		0x01	/* P40	*/
#define DIGITAL_PIN_MASK_23		0x01	/* P80	*/
#define DIGITAL_PIN_MASK_24		0x20	/* P05	*/
#define DIGITAL_PIN_MASK_25		0x02	/* P81	*/
#define DIGITAL_PIN_MASK_26		0x04	/* P82	*/
#define DIGITAL_PIN_MASK_27		0x20	/* P85	*/
#define DIGITAL_PIN_MASK_28		0x40	/* P86	*/
#define DIGITAL_PIN_MASK_29		0x80	/* P87	*/
#define DIGITAL_PIN_MASK_30		0x01	/* P30 	*/
#define DIGITAL_PIN_MASK_31		0x01	/* P50	*/
#define DIGITAL_PIN_MASK_32		0x02	/* P51	*/
#define DIGITAL_PIN_MASK_33		0x04	/* P52	*/
#define DIGITAL_PIN_MASK_34		0x08	/* P53	*/
#define DIGITAL_PIN_MASK_35		0x10	/* P54	*/
#define DIGITAL_PIN_MASK_36		0x20	/* P55	*/
#define DIGITAL_PIN_MASK_37		0x40	/* P56	*/
#define DIGITAL_PIN_MASK_38		0x80	/* P57	*/
#define DIGITAL_PIN_MASK_39		0x80	/* P17	*/
#define DIGITAL_PIN_MASK_40		0x04	/* P12	*/
#define DIGITAL_PIN_MASK_41		0x02	/* P11 	*/
#define DIGITAL_PIN_MASK_42		0x01	/* P10	*/
#define DIGITAL_PIN_MASK_43		0x01	/* P90 	*/
#define DIGITAL_PIN_MASK_44		0x02	/* P91 	*/
#define DIGITAL_PIN_MASK_45		0x04	/* P92	*/
#define DIGITAL_PIN_MASK_46		0x08	/* P93	*/
#define DIGITAL_PIN_MASK_47		0x10	/* P94	*/
#define DIGITAL_PIN_MASK_48		0x80	/* P97	*/
#define DIGITAL_PIN_MASK_49		0x04	/* P112	*/
#define DIGITAL_PIN_MASK_50		0x08	/* P113	*/
#define DIGITAL_PIN_MASK_51		0x10	/* P114	*/
#define DIGITAL_PIN_MASK_52		0x02	/* P101	*/
#define DIGITAL_PIN_MASK_53		0x02	/* P111	*/
#define DIGITAL_PIN_MASK_54		0x40	/* P146	*/
#define DIGITAL_PIN_MASK_55		0x08	/* P23	*/
#define DIGITAL_PIN_MASK_56		0x04	/* P22	*/
#define DIGITAL_PIN_MASK_57		0x02	/* P21	*/
#define DIGITAL_PIN_MASK_58		0x01	/* P130	*/
#define DIGITAL_PIN_MASK_59		0x04	/* P102	*/
#define DIGITAL_PIN_MASK_60		0x40	/* P06	*/
#define DIGITAL_PIN_MASK_61		0x80	/* P137	*/
#define DIGITAL_PIN_MASK_62		0x01	/* P70	*/
#define DIGITAL_PIN_MASK_63		0x02	/* P71	*/
#define DIGITAL_PIN_MASK_64		0x04	/* P72	*/
#define DIGITAL_PIN_MASK_65		0x08	/* P73	*/
#define DIGITAL_PIN_MASK_66		0x10	/* P74	*/
#define DIGITAL_PIN_MASK_67		0x20	/* P75	*/
#define DIGITAL_PIN_MASK_68		0x40	/* P76	*/
#define DIGITAL_PIN_MASK_69		0x80	/* P77	*/
#define DIGITAL_PIN_MASK_70		0x02	/* P121	*/
#define DIGITAL_PIN_MASK_71		0x04	/* P122	*/
#define DIGITAL_PIN_MASK_72		0x08	/* P123	*/
#define DIGITAL_PIN_MASK_73		0x10	/* P124	*/
#define DIGITAL_PIN_MASK_74		0x20	/* P125	*/
#define DIGITAL_PIN_MASK_75		0x40	/* P126	*/
#define DIGITAL_PIN_MASK_76		0x80	/* P127	*/
#define DIGITAL_PIN_MASK_77		0x02	/* P41	*/
#define DIGITAL_PIN_MASK_78		0x20	/* P45	*/
#define DIGITAL_PIN_MASK_79		0x04	/* P32	*/
#define DIGITAL_PIN_MASK_80		0x20	/* P35	*/
#define DIGITAL_PIN_MASK_81		0x40	/* P36	*/
#define DIGITAL_PIN_MASK_82		0x80	/* P37	*/
#define DIGITAL_PIN_MASK_83		0x01	/* P120	*/
#define DIGITAL_PIN_MASK_84		0x02	/* P01	*/
#define DIGITAL_PIN_MASK_85		0x02	/* P141	*/
#define DIGITAL_PIN_MASK_86		0x04	/* P142	*/
#define DIGITAL_PIN_MASK_87		0x01	/* P140	*/
#define DIGITAL_PIN_MASK_88		0x01	/* P00	*/
#define DIGITAL_PIN_MASK_89		0x40	/* P16	*/
#define DIGITAL_PIN_MASK_90		0x04	/* P62	*/
#define DIGITAL_PIN_MASK_91		0x08	/* P63	*/
#define DIGITAL_PIN_MASK_92		0x80	/* P47	*/
#define DIGITAL_PIN_MASK_93		0x01	/* P110	*/
#define DIGITAL_PIN_MASK_94		0x10	/* P04	*/
#define DIGITAL_PIN_MASK_95		0x80	/* P07	*/
#define DIGITAL_PIN_MASK_96		0x20	/* P15	*/
#define DIGITAL_PIN_MASK_97		0x08	/* P43	*/
#define DIGITAL_PIN_MASK_98		0x10	/* P44	*/
#define DIGITAL_PIN_MASK_99		0x20	/* P95	*/
#define DIGITAL_PIN_MASK_100	0x40	/* P96	*/
#define DIGITAL_PIN_MASK_101	0x10	/* P84	*/
#define DIGITAL_PIN_MASK_102	0x08	/* P83	*/
#define DIGITAL_PIN_MASK_103	0x20	/* P115	*/
#define DIGITAL_PIN_MASK_104	0x40	/* P116	*/
#define DIGITAL_PIN_MASK_105	0x80	/* P117	*/
#define DIGITAL_PIN_MASK_106	0x80	/* P147	*/
#define DIGITAL_PIN_MASK_107	0x01	/* P100	*/
#define DIGITAL_PIN_MASK_108	0x40	/* P156	*/
#define DIGITAL_PIN_MASK_109	0x20	/* P155	*/
#define DIGITAL_PIN_MASK_110	0x10	/* P154	*/
#define DIGITAL_PIN_MASK_111	0x08	/* P153	*/
#define DIGITAL_PIN_MASK_112	0x04	/* P152	*/
#define DIGITAL_PIN_MASK_113	0x02	/* P151	*/
#define DIGITAL_PIN_MASK_114	0x01	/* P150	*/
#define DIGITAL_PIN_MASK_115	0x80	/* P27	*/
#define DIGITAL_PIN_MASK_116	0x40	/* P26	*/
#define DIGITAL_PIN_MASK_117	0x20	/* P25	*/
#define DIGITAL_PIN_MASK_118	0x10	/* P24	*/


/* Add for G23 PMCA & PMCT & PMCE */
// PMCA : exist only PMCA 0, 1, 2, 3, 10, 11, 12, 14, 15
// Px0 -> 001, Px1 -> 0x02, Px2 -> 0x04, Px3 -> 0x08, Px4 -> 0x10, Px5 -> 0x20, Px6 -> 0x40, Px7 -> 0x80
#define DIGITAL_PIN_PMCA_0		0x08	/* P33	*/
#define DIGITAL_PIN_PMCA_1		0x10	/* P34	*/
#define DIGITAL_PIN_PMCA_2		0x20	/* P145	*/
#define DIGITAL_PIN_PMCA_3		0x40	/* P106	*/
#define DIGITAL_PIN_PMCA_4		0x20	/* P105	*/
#define DIGITAL_PIN_PMCA_5		0x10	/* P104	*/
#define DIGITAL_PIN_PMCA_6		0x08	/* P103	*/
#define DIGITAL_PIN_PMCA_7		0x00	/* P46	*/
#define DIGITAL_PIN_PMCA_8		0x00	/* P42	*/
#define DIGITAL_PIN_PMCA_9		0x02	/* P31	*/
#define DIGITAL_PIN_PMCA_10		0x00	/* P64	*/
#define DIGITAL_PIN_PMCA_11		0x00	/* P65	*/
#define DIGITAL_PIN_PMCA_12		0x00	/* P66	*/
#define DIGITAL_PIN_PMCA_13		0x00	/* P67	*/
#define DIGITAL_PIN_PMCA_14		0x10	/* P144	*/
#define DIGITAL_PIN_PMCA_15		0x08	/* P143	*/
#define DIGITAL_PIN_PMCA_16		0x04	/* P02	*/
#define DIGITAL_PIN_PMCA_17		0x08	/* P03	*/
#define DIGITAL_PIN_PMCA_18		0x08	/* P13	*/
#define DIGITAL_PIN_PMCA_19		0x10	/* P14	*/
#define DIGITAL_PIN_PMCA_20		0x00	/* P61	*/
#define DIGITAL_PIN_PMCA_21		0x00	/* P60	*/
#define DIGITAL_PIN_PMCA_22		0x00	/* P40	*/
#define DIGITAL_PIN_PMCA_23		0x00	/* P80	*/
#define DIGITAL_PIN_PMCA_24		0x20	/* P05	*/
#define DIGITAL_PIN_PMCA_25		0x00	/* P81	*/
#define DIGITAL_PIN_PMCA_26		0x00	/* P82	*/
#define DIGITAL_PIN_PMCA_27		0x00	/* P85	*/
#define DIGITAL_PIN_PMCA_28		0x00	/* P86	*/
#define DIGITAL_PIN_PMCA_29		0x00	/* P87	*/
#define DIGITAL_PIN_PMCA_30		0x01	/* P30 	*/
#define DIGITAL_PIN_PMCA_31		0x00	/* P50	*/
#define DIGITAL_PIN_PMCA_32		0x00	/* P51	*/
#define DIGITAL_PIN_PMCA_33		0x00	/* P52	*/
#define DIGITAL_PIN_PMCA_34		0x00	/* P53	*/
#define DIGITAL_PIN_PMCA_35		0x00	/* P54	*/
#define DIGITAL_PIN_PMCA_36		0x00	/* P55	*/
#define DIGITAL_PIN_PMCA_37		0x00	/* P56	*/
#define DIGITAL_PIN_PMCA_38		0x00	/* P57	*/
#define DIGITAL_PIN_PMCA_39		0x80	/* P17	*/
#define DIGITAL_PIN_PMCA_40		0x04	/* P12	*/
#define DIGITAL_PIN_PMCA_41		0x02	/* P11 	*/
#define DIGITAL_PIN_PMCA_42		0x01	/* P10	*/
#define DIGITAL_PIN_PMCA_43		0x00	/* P90 	*/
#define DIGITAL_PIN_PMCA_44		0x00	/* P91 	*/
#define DIGITAL_PIN_PMCA_45		0x00	/* P92	*/
#define DIGITAL_PIN_PMCA_46		0x00	/* P93	*/
#define DIGITAL_PIN_PMCA_47		0x00	/* P94	*/
#define DIGITAL_PIN_PMCA_48		0x00	/* P97	*/
#define DIGITAL_PIN_PMCA_49		0x04	/* P112	*/
#define DIGITAL_PIN_PMCA_50		0x08	/* P113	*/
#define DIGITAL_PIN_PMCA_51		0x10	/* P114	*/
#define DIGITAL_PIN_PMCA_52		0x02	/* P101	*/
#define DIGITAL_PIN_PMCA_53		0x02	/* P111	*/
#define DIGITAL_PIN_PMCA_54		0x40	/* P146	*/
#define DIGITAL_PIN_PMCA_55		0x08	/* P23	*/
#define DIGITAL_PIN_PMCA_56		0x04	/* P22	*/
#define DIGITAL_PIN_PMCA_57		0x02	/* P21	*/
#define DIGITAL_PIN_PMCA_58		0x00	/* P130	*/
#define DIGITAL_PIN_PMCA_59		0x04	/* P102	*/
#define DIGITAL_PIN_PMCA_60		0x40	/* P06	*/
#define DIGITAL_PIN_PMCA_61		0x00	/* P137	*/
#define DIGITAL_PIN_PMCA_62		0x00	/* P70	*/
#define DIGITAL_PIN_PMCA_63		0x00	/* P71	*/
#define DIGITAL_PIN_PMCA_64		0x00	/* P72	*/
#define DIGITAL_PIN_PMCA_65		0x00	/* P73	*/
#define DIGITAL_PIN_PMCA_66		0x00	/* P74	*/
#define DIGITAL_PIN_PMCA_67		0x00	/* P75	*/
#define DIGITAL_PIN_PMCA_68		0x00	/* P76	*/
#define DIGITAL_PIN_PMCA_69		0x00	/* P77	*/
#define DIGITAL_PIN_PMCA_70		0x02	/* P121	*/
#define DIGITAL_PIN_PMCA_71		0x04	/* P122	*/
#define DIGITAL_PIN_PMCA_72		0x08	/* P123	*/
#define DIGITAL_PIN_PMCA_73		0x10	/* P124	*/
#define DIGITAL_PIN_PMCA_74		0x20	/* P125	*/
#define DIGITAL_PIN_PMCA_75		0x40	/* P126	*/
#define DIGITAL_PIN_PMCA_76		0x80	/* P127	*/
#define DIGITAL_PIN_PMCA_77		0x00	/* P41	*/
#define DIGITAL_PIN_PMCA_78		0x00	/* P45	*/
#define DIGITAL_PIN_PMCA_79		0x04	/* P32	*/
#define DIGITAL_PIN_PMCA_80		0x20	/* P35	*/
#define DIGITAL_PIN_PMCA_81		0x40	/* P36	*/
#define DIGITAL_PIN_PMCA_82		0x80	/* P37	*/
#define DIGITAL_PIN_PMCA_83		0x01	/* P120	*/
#define DIGITAL_PIN_PMCA_84		0x02	/* P01	*/

#define DIGITAL_PIN_PMCA_85		0x02	/* P141	*/
#define DIGITAL_PIN_PMCA_86		0x04	/* P142	*/
#define DIGITAL_PIN_PMCA_87		0x01	/* P140	*/
#define DIGITAL_PIN_PMCA_88		0x01	/* P00	*/
#define DIGITAL_PIN_PMCA_89		0x40	/* P16	*/
#define DIGITAL_PIN_PMCA_90		0x00	/* P62	*/
#define DIGITAL_PIN_PMCA_91		0x00	/* P63	*/
#define DIGITAL_PIN_PMCA_92		0x00	/* P47	*/
#define DIGITAL_PIN_PMCA_93		0x01	/* P110	*/
#define DIGITAL_PIN_PMCA_94		0x10	/* P04	*/
#define DIGITAL_PIN_PMCA_95		0x80	/* P07	*/
#define DIGITAL_PIN_PMCA_96		0x20	/* P15	*/
#define DIGITAL_PIN_PMCA_97		0x00	/* P43	*/
#define DIGITAL_PIN_PMCA_98		0x00	/* P44	*/
#define DIGITAL_PIN_PMCA_99		0x00	/* P95	*/
#define DIGITAL_PIN_PMCA_100	0x00	/* P96	*/
#define DIGITAL_PIN_PMCA_101	0x00	/* P84	*/
#define DIGITAL_PIN_PMCA_102	0x00	/* P83	*/
#define DIGITAL_PIN_PMCA_103	0x20	/* P115	*/
#define DIGITAL_PIN_PMCA_104	0x40	/* P116	*/
#define DIGITAL_PIN_PMCA_105	0x80	/* P117	*/
#define DIGITAL_PIN_PMCA_106	0x80	/* P147	*/
#define DIGITAL_PIN_PMCA_107	0x01	/* P100	*/
#define DIGITAL_PIN_PMCA_108	0x40	/* P156	*/
#define DIGITAL_PIN_PMCA_109	0x20	/* P155	*/
#define DIGITAL_PIN_PMCA_110	0x10	/* P154	*/
#define DIGITAL_PIN_PMCA_111	0x08	/* P153	*/
#define DIGITAL_PIN_PMCA_112	0x04	/* P152	*/
#define DIGITAL_PIN_PMCA_113	0x02	/* P151	*/
#define DIGITAL_PIN_PMCA_114	0x01	/* P150	*/
#define DIGITAL_PIN_PMCA_115	0x80	/* P27	*/
#define DIGITAL_PIN_PMCA_116	0x40	/* P26	*/
#define DIGITAL_PIN_PMCA_117	0x20	/* P25	*/
#define DIGITAL_PIN_PMCA_118	0x10	/* P24	*/


// PMCT
// PMCT : exist only part of PMCT0, 2, 3, 5, 6, 7, 15 (Refer manual)
// Px0 -> 001, Px1 -> 0x02, Px2 -> 0x04, Px3 -> 0x08, Px4 -> 0x10, Px5 -> 0x20, Px6 -> 0x40, Px7 -> 0x80

