renesas/ArduinoCore-rl78g23_fpb_128p/variants/g23-fpb-128p/pins_variant.h
#define DIGITAL_PIN_PMCT_0		0x00	/* P33	*/
#define DIGITAL_PIN_PMCT_1		0x00	/* P34	*/
#define DIGITAL_PIN_PMCT_2		0x00	/* P145	*/
#define DIGITAL_PIN_PMCT_3		0x00	/* P106	*/
#define DIGITAL_PIN_PMCT_4		0x00	/* P105	*/
#define DIGITAL_PIN_PMCT_5		0x00	/* P104	*/
#define DIGITAL_PIN_PMCT_6		0x00	/* P103	*/
#define DIGITAL_PIN_PMCT_7		0x00	/* P46	*/
#define DIGITAL_PIN_PMCT_8		0x00	/* P42	*/
#define DIGITAL_PIN_PMCT_9		0x02	/* P31	*/
#define DIGITAL_PIN_PMCT_10		0x10	/* P64	*/
#define DIGITAL_PIN_PMCT_11		0x20	/* P65	*/
#define DIGITAL_PIN_PMCT_12		0x40	/* P66	*/
#define DIGITAL_PIN_PMCT_13		0x80	/* P67	*/
#define DIGITAL_PIN_PMCT_14		0x00	/* P144	*/
#define DIGITAL_PIN_PMCT_15		0x00	/* P143	*/
#define DIGITAL_PIN_PMCT_16		0x04	/* P02	*/
#define DIGITAL_PIN_PMCT_17		0x08	/* P03	*/
#define DIGITAL_PIN_PMCT_18		0x00	/* P13	*/
#define DIGITAL_PIN_PMCT_19		0x00	/* P14	*/
#define DIGITAL_PIN_PMCT_20		0x00	/* P61	*/
#define DIGITAL_PIN_PMCT_21		0x00	/* P60	*/
#define DIGITAL_PIN_PMCT_22		0x00	/* P40	*/
#define DIGITAL_PIN_PMCT_23		0x00	/* P80	*/
#define DIGITAL_PIN_PMCT_24		0x20	/* P05	*/
#define DIGITAL_PIN_PMCT_25		0x00	/* P81	*/
#define DIGITAL_PIN_PMCT_26		0x00	/* P82	*/
#define DIGITAL_PIN_PMCT_27		0x00	/* P85	*/
#define DIGITAL_PIN_PMCT_28		0x00	/* P86	*/
#define DIGITAL_PIN_PMCT_29		0x00	/* P87	*/
#define DIGITAL_PIN_PMCT_30		0x01	/* P30 	*/
#define DIGITAL_PIN_PMCT_31		0x01	/* P50	*/
#define DIGITAL_PIN_PMCT_32		0x00	/* P51	*/
#define DIGITAL_PIN_PMCT_33		0x00	/* P52	*/
#define DIGITAL_PIN_PMCT_34		0x00	/* P53	*/
#define DIGITAL_PIN_PMCT_35		0x00	/* P54	*/
#define DIGITAL_PIN_PMCT_36		0x00	/* P55	*/
#define DIGITAL_PIN_PMCT_37		0x00	/* P56	*/
#define DIGITAL_PIN_PMCT_38		0x00	/* P57	*/
#define DIGITAL_PIN_PMCT_39		0x00	/* P17	*/
#define DIGITAL_PIN_PMCT_40		0x00	/* P12	*/
#define DIGITAL_PIN_PMCT_41		0x00	/* P11 	*/
#define DIGITAL_PIN_PMCT_42		0x00	/* P10	*/
#define DIGITAL_PIN_PMCT_43		0x00	/* P90 	*/
#define DIGITAL_PIN_PMCT_44		0x00	/* P91 	*/
#define DIGITAL_PIN_PMCT_45		0x00	/* P92	*/
#define DIGITAL_PIN_PMCT_46		0x00	/* P93	*/
#define DIGITAL_PIN_PMCT_47		0x00	/* P94	*/
#define DIGITAL_PIN_PMCT_48		0x00	/* P97	*/
#define DIGITAL_PIN_PMCT_49		0x00	/* P112	*/
#define DIGITAL_PIN_PMCT_50		0x00	/* P113	*/
#define DIGITAL_PIN_PMCT_51		0x00	/* P114	*/
#define DIGITAL_PIN_PMCT_52		0x00	/* P101	*/
#define DIGITAL_PIN_PMCT_53		0x00	/* P111	*/
#define DIGITAL_PIN_PMCT_54		0x00	/* P146	*/
#define DIGITAL_PIN_PMCT_55		0x08	/* P23	*/
#define DIGITAL_PIN_PMCT_56		0x04	/* P22	*/
#define DIGITAL_PIN_PMCT_57		0x00	/* P21	*/
#define DIGITAL_PIN_PMCT_58		0x00	/* P130	*/
#define DIGITAL_PIN_PMCT_59		0x00	/* P102	*/
#define DIGITAL_PIN_PMCT_60		0x40	/* P06	*/
#define DIGITAL_PIN_PMCT_61		0x00	/* P137	*/
#define DIGITAL_PIN_PMCT_62		0x01	/* P70	*/
#define DIGITAL_PIN_PMCT_63		0x02	/* P71	*/
#define DIGITAL_PIN_PMCT_64		0x04	/* P72	*/
#define DIGITAL_PIN_PMCT_65		0x08	/* P73	*/
#define DIGITAL_PIN_PMCT_66		0x10	/* P74	*/
#define DIGITAL_PIN_PMCT_67		0x20	/* P75	*/
#define DIGITAL_PIN_PMCT_68		0x40	/* P76	*/
#define DIGITAL_PIN_PMCT_69		0x80	/* P77	*/
#define DIGITAL_PIN_PMCT_70		0x00	/* P121	*/
#define DIGITAL_PIN_PMCT_71		0x00	/* P122	*/
#define DIGITAL_PIN_PMCT_72		0x00	/* P123	*/
#define DIGITAL_PIN_PMCT_73		0x00	/* P124	*/
#define DIGITAL_PIN_PMCT_74		0x00	/* P125	*/
#define DIGITAL_PIN_PMCT_75		0x00	/* P126	*/
#define DIGITAL_PIN_PMCT_76		0x00	/* P127	*/
#define DIGITAL_PIN_PMCT_77		0x00	/* P41	*/
#define DIGITAL_PIN_PMCT_78		0x00	/* P45	*/
#define DIGITAL_PIN_PMCT_79		0x00	/* P32	*/
#define DIGITAL_PIN_PMCT_80		0x00	/* P35	*/
#define DIGITAL_PIN_PMCT_81		0x00	/* P36	*/
#define DIGITAL_PIN_PMCT_82		0x00	/* P37	*/
#define DIGITAL_PIN_PMCT_83		0x00	/* P120	*/
#define DIGITAL_PIN_PMCT_84		0x02	/* P01	*/

#define DIGITAL_PIN_PMCT_85		0x00	/* P141	*/
#define DIGITAL_PIN_PMCT_86		0x00	/* P142	*/
#define DIGITAL_PIN_PMCT_87		0x00	/* P140	*/
#define DIGITAL_PIN_PMCT_88		0x01	/* P00	*/
#define DIGITAL_PIN_PMCT_89		0x00	/* P16	*/
#define DIGITAL_PIN_PMCT_90		0x00	/* P62	*/
#define DIGITAL_PIN_PMCT_91		0x00	/* P63	*/
#define DIGITAL_PIN_PMCT_92		0x00	/* P47	*/
#define DIGITAL_PIN_PMCT_93		0x00	/* P110	*/
#define DIGITAL_PIN_PMCT_94		0x00	/* P04	*/
#define DIGITAL_PIN_PMCT_95		0x00	/* P07	*/
#define DIGITAL_PIN_PMCT_96		0x00	/* P15	*/
#define DIGITAL_PIN_PMCT_97		0x00	/* P43	*/
#define DIGITAL_PIN_PMCT_98		0x00	/* P44	*/
#define DIGITAL_PIN_PMCT_99		0x00	/* P95	*/
#define DIGITAL_PIN_PMCT_100	0x00	/* P96	*/
#define DIGITAL_PIN_PMCT_101	0x00	/* P84	*/
#define DIGITAL_PIN_PMCT_102	0x00	/* P83	*/
#define DIGITAL_PIN_PMCT_103	0x00	/* P115	*/
#define DIGITAL_PIN_PMCT_104	0x00	/* P116	*/
#define DIGITAL_PIN_PMCT_105	0x00	/* P117	*/
#define DIGITAL_PIN_PMCT_106	0x00	/* P147	*/
#define DIGITAL_PIN_PMCT_107	0x00	/* P100	*/
#define DIGITAL_PIN_PMCT_108	0x00	/* P156	*/
#define DIGITAL_PIN_PMCT_109	0x20	/* P155	*/
#define DIGITAL_PIN_PMCT_110	0x10	/* P154	*/
#define DIGITAL_PIN_PMCT_111	0x08	/* P153	*/
#define DIGITAL_PIN_PMCT_112	0x04	/* P152	*/
#define DIGITAL_PIN_PMCT_113	0x02	/* P151	*/
#define DIGITAL_PIN_PMCT_114	0x01	/* P150	*/
#define DIGITAL_PIN_PMCT_115	0x80	/* P27	*/
#define DIGITAL_PIN_PMCT_116	0x40	/* P26	*/
#define DIGITAL_PIN_PMCT_117	0x20	/* P25	*/
#define DIGITAL_PIN_PMCT_118	0x10	/* P24	*/


// PMCE
// PMCE : exist only part of PMCE0, 1, 5, 6 (refer manual)
// Px0 -> 001, Px1 -> 0x02, Px2 -> 0x04, Px3 -> 0x08, Px4 -> 0x10, Px5 -> 0x20, Px6 -> 0x40, Px7 -> 0x80


#define DIGITAL_PIN_PMCE_0		0x00	/* P33	*/
#define DIGITAL_PIN_PMCE_1		0x00	/* P34	*/
#define DIGITAL_PIN_PMCE_2		0x00	/* P145	*/
#define DIGITAL_PIN_PMCE_3		0x00	/* P106	*/
#define DIGITAL_PIN_PMCE_4		0x00	/* P105	*/
#define DIGITAL_PIN_PMCE_5		0x00	/* P104	*/
#define DIGITAL_PIN_PMCE_6		0x00	/* P103	*/
#define DIGITAL_PIN_PMCE_7		0x00	/* P46	*/
#define DIGITAL_PIN_PMCE_8		0x00	/* P42	*/
#define DIGITAL_PIN_PMCE_9		0x00	/* P31	*/
#define DIGITAL_PIN_PMCE_10		0x00	/* P64	*/
#define DIGITAL_PIN_PMCE_11		0x00	/* P65	*/
#define DIGITAL_PIN_PMCE_12		0x00	/* P66	*/
#define DIGITAL_PIN_PMCE_13		0x00	/* P67	*/
#define DIGITAL_PIN_PMCE_14		0x00	/* P144	*/
#define DIGITAL_PIN_PMCE_15		0x00	/* P143	*/
#define DIGITAL_PIN_PMCE_16		0x00	/* P02	*/
#define DIGITAL_PIN_PMCE_17		0x00	/* P03	*/
#define DIGITAL_PIN_PMCE_18		0x08	/* P13	*/
#define DIGITAL_PIN_PMCE_19		0x10	/* P14	*/
#define DIGITAL_PIN_PMCE_20		0x02	/* P61	*/
#define DIGITAL_PIN_PMCE_21		0x01	/* P60	*/
#define DIGITAL_PIN_PMCE_22		0x00	/* P40	*/
#define DIGITAL_PIN_PMCE_23		0x00	/* P80	*/
#define DIGITAL_PIN_PMCE_24		0x00	/* P05	*/
#define DIGITAL_PIN_PMCE_25		0x00	/* P81	*/
#define DIGITAL_PIN_PMCE_26		0x00	/* P82	*/
#define DIGITAL_PIN_PMCE_27		0x00	/* P85	*/
#define DIGITAL_PIN_PMCE_28		0x00	/* P86	*/
#define DIGITAL_PIN_PMCE_29		0x00	/* P87	*/
#define DIGITAL_PIN_PMCE_30		0x00	/* P30 	*/
#define DIGITAL_PIN_PMCE_31		0x01	/* P50	*/
#define DIGITAL_PIN_PMCE_32		0x02	/* P51	*/
#define DIGITAL_PIN_PMCE_33		0x00	/* P52	*/
#define DIGITAL_PIN_PMCE_34		0x00	/* P53	*/
#define DIGITAL_PIN_PMCE_35		0x00	/* P54	*/
#define DIGITAL_PIN_PMCE_36		0x00	/* P55	*/
#define DIGITAL_PIN_PMCE_37		0x00	/* P56	*/
#define DIGITAL_PIN_PMCE_38		0x00	/* P57	*/
#define DIGITAL_PIN_PMCE_39		0x80	/* P17	*/
#define DIGITAL_PIN_PMCE_40		0x04	/* P12	*/
#define DIGITAL_PIN_PMCE_41		0x02	/* P11 	*/
#define DIGITAL_PIN_PMCE_42		0x01	/* P10	*/
#define DIGITAL_PIN_PMCE_43		0x00	/* P90 	*/
#define DIGITAL_PIN_PMCE_44		0x00	/* P91 	*/
#define DIGITAL_PIN_PMCE_45		0x00	/* P92	*/
#define DIGITAL_PIN_PMCE_46		0x00	/* P93	*/
#define DIGITAL_PIN_PMCE_47		0x00	/* P94	*/
#define DIGITAL_PIN_PMCE_48		0x00	/* P97	*/
#define DIGITAL_PIN_PMCE_49		0x00	/* P112	*/
#define DIGITAL_PIN_PMCE_50		0x00	/* P113	*/
#define DIGITAL_PIN_PMCE_51		0x00	/* P114	*/
#define DIGITAL_PIN_PMCE_52		0x00	/* P101	*/
#define DIGITAL_PIN_PMCE_53		0x00	/* P111	*/
#define DIGITAL_PIN_PMCE_54		0x00	/* P146	*/
#define DIGITAL_PIN_PMCE_55		0x00	/* P23	*/
#define DIGITAL_PIN_PMCE_56		0x00	/* P22	*/
#define DIGITAL_PIN_PMCE_57		0x00	/* P21	*/
#define DIGITAL_PIN_PMCE_58		0x00	/* P130	*/
#define DIGITAL_PIN_PMCE_59		0x00	/* P102	*/
#define DIGITAL_PIN_PMCE_60		0x00	/* P06	*/
#define DIGITAL_PIN_PMCE_61		0x00	/* P137	*/
#define DIGITAL_PIN_PMCE_62		0x00	/* P70	*/
#define DIGITAL_PIN_PMCE_63		0x00	/* P71	*/
#define DIGITAL_PIN_PMCE_64		0x00	/* P72	*/
#define DIGITAL_PIN_PMCE_65		0x00	/* P73	*/
#define DIGITAL_PIN_PMCE_66		0x00	/* P74	*/
#define DIGITAL_PIN_PMCE_67		0x00	/* P75	*/
#define DIGITAL_PIN_PMCE_68		0x00	/* P76	*/
#define DIGITAL_PIN_PMCE_69		0x00	/* P77	*/
#define DIGITAL_PIN_PMCE_70		0x00	/* P121	*/
#define DIGITAL_PIN_PMCE_71		0x00	/* P122	*/
#define DIGITAL_PIN_PMCE_72		0x00	/* P123	*/
#define DIGITAL_PIN_PMCE_73		0x00	/* P124	*/
#define DIGITAL_PIN_PMCE_74		0x00	/* P125	*/
#define DIGITAL_PIN_PMCE_75		0x00	/* P126	*/
#define DIGITAL_PIN_PMCE_76		0x00	/* P127	*/
#define DIGITAL_PIN_PMCE_77		0x00	/* P41	*/
#define DIGITAL_PIN_PMCE_78		0x00	/* P45	*/
#define DIGITAL_PIN_PMCE_79		0x00	/* P32	*/
#define DIGITAL_PIN_PMCE_80		0x00	/* P35	*/
#define DIGITAL_PIN_PMCE_81		0x00	/* P36	*/
#define DIGITAL_PIN_PMCE_82		0x00	/* P37	*/
#define DIGITAL_PIN_PMCE_83		0x00	/* P120	*/
#define DIGITAL_PIN_PMCE_84		0x02	/* P01	*/

#define DIGITAL_PIN_PMCE_85		0x00	/* P141	*/
#define DIGITAL_PIN_PMCE_86		0x00	/* P142	*/
#define DIGITAL_PIN_PMCE_87		0x00	/* P140	*/
#define DIGITAL_PIN_PMCE_88		0x00	/* P00	*/
#define DIGITAL_PIN_PMCE_89		0x40	/* P16	*/
#define DIGITAL_PIN_PMCE_90		0x00	/* P62	*/
#define DIGITAL_PIN_PMCE_91		0x00	/* P63	*/
#define DIGITAL_PIN_PMCE_92		0x00	/* P47	*/
#define DIGITAL_PIN_PMCE_93		0x00	/* P110	*/
#define DIGITAL_PIN_PMCE_94		0x00	/* P04	*/
#define DIGITAL_PIN_PMCE_95		0x00	/* P07	*/
#define DIGITAL_PIN_PMCE_96		0x20	/* P15	*/
#define DIGITAL_PIN_PMCE_97		0x00	/* P43	*/
#define DIGITAL_PIN_PMCE_98		0x00	/* P44	*/
#define DIGITAL_PIN_PMCE_99		0x00	/* P95	*/
#define DIGITAL_PIN_PMCE_100	0x00	/* P96	*/
#define DIGITAL_PIN_PMCE_101	0x00	/* P84	*/
#define DIGITAL_PIN_PMCE_102	0x00	/* P83	*/
#define DIGITAL_PIN_PMCE_103	0x00	/* P115	*/
#define DIGITAL_PIN_PMCE_104	0x00	/* P116	*/
#define DIGITAL_PIN_PMCE_105	0x00	/* P117	*/
#define DIGITAL_PIN_PMCE_106	0x00	/* P147	*/
#define DIGITAL_PIN_PMCE_107	0x00	/* P100	*/
#define DIGITAL_PIN_PMCE_108	0x00	/* P156	*/
#define DIGITAL_PIN_PMCE_109	0x00	/* P155	*/
#define DIGITAL_PIN_PMCE_110	0x00	/* P154	*/
#define DIGITAL_PIN_PMCE_111	0x00	/* P153	*/
#define DIGITAL_PIN_PMCE_112	0x00	/* P152	*/
#define DIGITAL_PIN_PMCE_113	0x00	/* P151	*/
#define DIGITAL_PIN_PMCE_114	0x00	/* P150	*/
#define DIGITAL_PIN_PMCE_115	0x00	/* P27	*/
#define DIGITAL_PIN_PMCE_116	0x00	/* P26	*/
#define DIGITAL_PIN_PMCE_117	0x00	/* P25	*/
#define DIGITAL_PIN_PMCE_118	0x00	/* P24	*/


