renesas/ArduinoCore-rl78g23_fpb_128p/variants/g23-fpb-128p/pins_variant.h
/* Define Digital Pin CCDE */
// only P63, 62,61,60,50,51,17,16 (Refer to manual)
// Px0 -> 001, Px1 -> 0x02, Px2 -> 0x04, Px3 -> 0x08, Px4 -> 0x10, Px5 -> 0x20, Px6 -> 0x40, Px7 -> 0x80

#define DIGITAL_PIN_CCDE_0		0x00	/* P33	*/
#define DIGITAL_PIN_CCDE_1		0x00	/* P34	*/
#define DIGITAL_PIN_CCDE_2		0x00	/* P145	*/
#define DIGITAL_PIN_CCDE_3		0x00	/* P106	*/
#define DIGITAL_PIN_CCDE_4		0x00	/* P105	*/
#define DIGITAL_PIN_CCDE_5		0x00	/* P104	*/
#define DIGITAL_PIN_CCDE_6		0x00	/* P103	*/
#define DIGITAL_PIN_CCDE_7		0x00	/* P46	*/
#define DIGITAL_PIN_CCDE_8		0x00	/* P42	*/
#define DIGITAL_PIN_CCDE_9		0x00	/* P31	*/
#define DIGITAL_PIN_CCDE_10		0x00	/* P64	*/
#define DIGITAL_PIN_CCDE_11		0x00	/* P65	*/
#define DIGITAL_PIN_CCDE_12		0x00	/* P66	*/
#define DIGITAL_PIN_CCDE_13		0x00	/* P67	*/
#define DIGITAL_PIN_CCDE_14		0x00	/* P144	*/
#define DIGITAL_PIN_CCDE_15		0x00	/* P143	*/
#define DIGITAL_PIN_CCDE_16		0x00	/* P02	*/
#define DIGITAL_PIN_CCDE_17		0x00	/* P03	*/
#define DIGITAL_PIN_CCDE_18		0x00	/* P13	*/
#define DIGITAL_PIN_CCDE_19		0x00	/* P14	*/
#define DIGITAL_PIN_CCDE_20		0x20	/* P61	*/
#define DIGITAL_PIN_CCDE_21		0x10	/* P60	*/
#define DIGITAL_PIN_CCDE_22		0x00	/* P40	*/
#define DIGITAL_PIN_CCDE_23		0x00	/* P80	*/
#define DIGITAL_PIN_CCDE_24		0x00	/* P05	*/
#define DIGITAL_PIN_CCDE_25		0x00	/* P81	*/
#define DIGITAL_PIN_CCDE_26		0x00	/* P82	*/
#define DIGITAL_PIN_CCDE_27		0x00	/* P85	*/
#define DIGITAL_PIN_CCDE_28		0x00	/* P86	*/
#define DIGITAL_PIN_CCDE_29		0x00	/* P87	*/
#define DIGITAL_PIN_CCDE_30		0x00	/* P30 	*/
#define DIGITAL_PIN_CCDE_31		0x08	/* P50	*/
#define DIGITAL_PIN_CCDE_32		0x04	/* P51	*/
#define DIGITAL_PIN_CCDE_33		0x00	/* P52	*/
#define DIGITAL_PIN_CCDE_34		0x00	/* P53	*/
#define DIGITAL_PIN_CCDE_35		0x00	/* P54	*/
#define DIGITAL_PIN_CCDE_36		0x00	/* P55	*/
#define DIGITAL_PIN_CCDE_37		0x00	/* P56	*/
#define DIGITAL_PIN_CCDE_38		0x00	/* P57	*/
#define DIGITAL_PIN_CCDE_39		0x02	/* P17	*/
#define DIGITAL_PIN_CCDE_40		0x00	/* P12	*/
#define DIGITAL_PIN_CCDE_41		0x00	/* P11 	*/
#define DIGITAL_PIN_CCDE_42		0x00	/* P10	*/
#define DIGITAL_PIN_CCDE_43		0x00	/* P90 	*/
#define DIGITAL_PIN_CCDE_44		0x00	/* P91 	*/
#define DIGITAL_PIN_CCDE_45		0x00	/* P92	*/
#define DIGITAL_PIN_CCDE_46		0x00	/* P93	*/
#define DIGITAL_PIN_CCDE_47		0x00	/* P94	*/
#define DIGITAL_PIN_CCDE_48		0x00	/* P97	*/
#define DIGITAL_PIN_CCDE_49		0x00	/* P112	*/
#define DIGITAL_PIN_CCDE_50		0x00	/* P113	*/
#define DIGITAL_PIN_CCDE_51		0x00	/* P114	*/
#define DIGITAL_PIN_CCDE_52		0x00	/* P101	*/
#define DIGITAL_PIN_CCDE_53		0x00	/* P111	*/
#define DIGITAL_PIN_CCDE_54		0x00	/* P146	*/
#define DIGITAL_PIN_CCDE_55		0x00	/* P23	*/
#define DIGITAL_PIN_CCDE_56		0x00	/* P22	*/
#define DIGITAL_PIN_CCDE_57		0x00	/* P21	*/
#define DIGITAL_PIN_CCDE_58		0x00	/* P130	*/
#define DIGITAL_PIN_CCDE_59		0x00	/* P102	*/
#define DIGITAL_PIN_CCDE_60		0x00	/* P06	*/
#define DIGITAL_PIN_CCDE_61		0x00	/* P137	*/
#define DIGITAL_PIN_CCDE_62		0x00	/* P70	*/
#define DIGITAL_PIN_CCDE_63		0x00	/* P71	*/
#define DIGITAL_PIN_CCDE_64		0x00	/* P72	*/
#define DIGITAL_PIN_CCDE_65		0x00	/* P73	*/
#define DIGITAL_PIN_CCDE_66		0x00	/* P74	*/
#define DIGITAL_PIN_CCDE_67		0x00	/* P75	*/
#define DIGITAL_PIN_CCDE_68		0x00	/* P76	*/
#define DIGITAL_PIN_CCDE_69		0x00	/* P77	*/
#define DIGITAL_PIN_CCDE_70		0x00	/* P121	*/
#define DIGITAL_PIN_CCDE_71		0x00	/* P122	*/
#define DIGITAL_PIN_CCDE_72		0x00	/* P123	*/
#define DIGITAL_PIN_CCDE_73		0x00	/* P124	*/
#define DIGITAL_PIN_CCDE_74		0x00	/* P125	*/
#define DIGITAL_PIN_CCDE_75		0x00	/* P126	*/
#define DIGITAL_PIN_CCDE_76		0x00	/* P127	*/
#define DIGITAL_PIN_CCDE_77		0x00	/* P41	*/
#define DIGITAL_PIN_CCDE_78		0x00	/* P45	*/
#define DIGITAL_PIN_CCDE_79		0x00	/* P32	*/
#define DIGITAL_PIN_CCDE_80		0x00	/* P35	*/
#define DIGITAL_PIN_CCDE_81		0x00	/* P36	*/
#define DIGITAL_PIN_CCDE_82		0x00	/* P37	*/
#define DIGITAL_PIN_CCDE_83		0x00	/* P120	*/
#define DIGITAL_PIN_CCDE_84		0x00	/* P01	*/
#define DIGITAL_PIN_CCDE_85		0x00	/* P141	*/
#define DIGITAL_PIN_CCDE_86		0x00	/* P142	*/
#define DIGITAL_PIN_CCDE_87		0x00	/* P140	*/
#define DIGITAL_PIN_CCDE_88		0x00	/* P00	*/
#define DIGITAL_PIN_CCDE_89		0x01	/* P16	*/
#define DIGITAL_PIN_CCDE_90		0x40	/* P62	*/
#define DIGITAL_PIN_CCDE_91		0x80	/* P63	*/
#define DIGITAL_PIN_CCDE_92		0x00	/* P47	*/
#define DIGITAL_PIN_CCDE_93		0x00	/* P110	*/
#define DIGITAL_PIN_CCDE_94		0x00	/* P04	*/
#define DIGITAL_PIN_CCDE_95		0x00	/* P07	*/
#define DIGITAL_PIN_CCDE_96		0x00	/* P15	*/
#define DIGITAL_PIN_CCDE_97		0x00	/* P43	*/
#define DIGITAL_PIN_CCDE_98		0x00	/* P44	*/
#define DIGITAL_PIN_CCDE_99		0x00	/* P95	*/
#define DIGITAL_PIN_CCDE_100	0x00	/* P96	*/
#define DIGITAL_PIN_CCDE_101	0x00	/* P84	*/
#define DIGITAL_PIN_CCDE_102	0x00	/* P83	*/
#define DIGITAL_PIN_CCDE_103	0x00	/* P115	*/
#define DIGITAL_PIN_CCDE_104	0x00	/* P116	*/
#define DIGITAL_PIN_CCDE_105	0x00	/* P117	*/
#define DIGITAL_PIN_CCDE_106	0x00	/* P147	*/
#define DIGITAL_PIN_CCDE_107	0x00	/* P100	*/
#define DIGITAL_PIN_CCDE_108	0x00	/* P156	*/
#define DIGITAL_PIN_CCDE_109	0x00	/* P155	*/
#define DIGITAL_PIN_CCDE_110	0x00	/* P154	*/
#define DIGITAL_PIN_CCDE_111	0x00	/* P153	*/
#define DIGITAL_PIN_CCDE_112	0x00	/* P152	*/
#define DIGITAL_PIN_CCDE_113	0x00	/* P151	*/
#define DIGITAL_PIN_CCDE_114	0x00	/* P150	*/
#define DIGITAL_PIN_CCDE_115	0x00	/* P27	*/
#define DIGITAL_PIN_CCDE_116	0x00	/* P26	*/
#define DIGITAL_PIN_CCDE_117	0x00	/* P25	*/
#define DIGITAL_PIN_CCDE_118    0x00    /* P24  */
/* Define Digital Pin PDIDIS */
// PDIDIS : exist only part of PDIDIS 0, 1, 3, 4, 5, 7, 8, 9, 12, 13, 14 (refer manual)
// Px0 -> 001, Px1 -> 0x02, Px2 -> 0x04, Px3 -> 0x08, Px4 -> 0x10, Px5 -> 0x20, Px6 -> 0x40, Px7 -> 0x80

#define DIGITAL_PIN_PDIDIS_0		0x00	/* P33	*/
#define DIGITAL_PIN_PDIDIS_1		0x10	/* P34	*/
#define DIGITAL_PIN_PDIDIS_2		0x00	/* P145	*/
#define DIGITAL_PIN_PDIDIS_3		0x00	/* P106	*/
#define DIGITAL_PIN_PDIDIS_4		0x00	/* P105	*/
#define DIGITAL_PIN_PDIDIS_5		0x00	/* P104	*/
#define DIGITAL_PIN_PDIDIS_6		0x00	/* P103	*/
#define DIGITAL_PIN_PDIDIS_7		0x00	/* P46	*/
#define DIGITAL_PIN_PDIDIS_8		0x04	/* P42	*/
#define DIGITAL_PIN_PDIDIS_9		0x00	/* P31	*/
#define DIGITAL_PIN_PDIDIS_10		0x00	/* P64	*/
#define DIGITAL_PIN_PDIDIS_11		0x00	/* P65	*/
#define DIGITAL_PIN_PDIDIS_12		0x00	/* P66	*/
#define DIGITAL_PIN_PDIDIS_13		0x00	/* P67	*/
#define DIGITAL_PIN_PDIDIS_14		0x10	/* P144	*/
#define DIGITAL_PIN_PDIDIS_15		0x08	/* P143	*/
#define DIGITAL_PIN_PDIDIS_16		0x04	/* P02	*/
#define DIGITAL_PIN_PDIDIS_17		0x08	/* P03	*/
#define DIGITAL_PIN_PDIDIS_18		0x08	/* P13	*/
#define DIGITAL_PIN_PDIDIS_19		0x10	/* P14	*/
#define DIGITAL_PIN_PDIDIS_20		0x00	/* P61	*/
#define DIGITAL_PIN_PDIDIS_21		0x00	/* P60	*/
#define DIGITAL_PIN_PDIDIS_22		0x00	/* P40	*/
#define DIGITAL_PIN_PDIDIS_23		0x01	/* P80	*/
#define DIGITAL_PIN_PDIDIS_24		0x00	/* P05	*/
#define DIGITAL_PIN_PDIDIS_25		0x02	/* P81	*/
#define DIGITAL_PIN_PDIDIS_26		0x04	/* P82	*/
#define DIGITAL_PIN_PDIDIS_27		0x00	/* P85	*/
#define DIGITAL_PIN_PDIDIS_28		0x00	/* P86	*/
#define DIGITAL_PIN_PDIDIS_29		0x00	/* P87	*/
#define DIGITAL_PIN_PDIDIS_30		0x00	/* P30 	*/
#define DIGITAL_PIN_PDIDIS_31		0x01	/* P50	*/
#define DIGITAL_PIN_PDIDIS_32		0x00	/* P51	*/
#define DIGITAL_PIN_PDIDIS_33		0x04	/* P52	*/
#define DIGITAL_PIN_PDIDIS_34		0x08	/* P53	*/
#define DIGITAL_PIN_PDIDIS_35		0x10	/* P54	*/
#define DIGITAL_PIN_PDIDIS_36		0x20	/* P55	*/
#define DIGITAL_PIN_PDIDIS_37		0x00	/* P56	*/
#define DIGITAL_PIN_PDIDIS_38		0x00	/* P57	*/
#define DIGITAL_PIN_PDIDIS_39		0x80	/* P17	*/
#define DIGITAL_PIN_PDIDIS_40		0x04	/* P12	*/
#define DIGITAL_PIN_PDIDIS_41		0x02	/* P11 	*/
#define DIGITAL_PIN_PDIDIS_42		0x01	/* P10	*/
#define DIGITAL_PIN_PDIDIS_43		0x00	/* P90 	*/
#define DIGITAL_PIN_PDIDIS_44		0x00	/* P91 	*/
#define DIGITAL_PIN_PDIDIS_45		0x00	/* P92	*/
#define DIGITAL_PIN_PDIDIS_46		0x00	/* P93	*/
#define DIGITAL_PIN_PDIDIS_47		0x00	/* P94	*/
#define DIGITAL_PIN_PDIDIS_48		0x00	/* P97	*/
#define DIGITAL_PIN_PDIDIS_49		0x00	/* P112	*/
#define DIGITAL_PIN_PDIDIS_50		0x00	/* P113	*/
#define DIGITAL_PIN_PDIDIS_51		0x00	/* P114	*/
#define DIGITAL_PIN_PDIDIS_52		0x00	/* P101	*/
#define DIGITAL_PIN_PDIDIS_53		0x00	/* P111	*/
#define DIGITAL_PIN_PDIDIS_54		0x00	/* P146	*/
#define DIGITAL_PIN_PDIDIS_55		0x00	/* P23	*/
#define DIGITAL_PIN_PDIDIS_56		0x00	/* P22	*/
#define DIGITAL_PIN_PDIDIS_57		0x00	/* P21	*/
#define DIGITAL_PIN_PDIDIS_58		0x00	/* P130	*/
#define DIGITAL_PIN_PDIDIS_59		0x00	/* P102	*/
#define DIGITAL_PIN_PDIDIS_60		0x00	/* P06	*/
#define DIGITAL_PIN_PDIDIS_61		0x80	/* P137	*/
#define DIGITAL_PIN_PDIDIS_62		0x00	/* P70	*/
#define DIGITAL_PIN_PDIDIS_63		0x02	/* P71	*/
#define DIGITAL_PIN_PDIDIS_64		0x04	/* P72	*/
#define DIGITAL_PIN_PDIDIS_65		0x00	/* P73	*/
#define DIGITAL_PIN_PDIDIS_66		0x10	/* P74	*/
#define DIGITAL_PIN_PDIDIS_67		0x00	/* P75	*/
#define DIGITAL_PIN_PDIDIS_68		0x00	/* P76	*/
#define DIGITAL_PIN_PDIDIS_69		0x00	/* P77	*/
#define DIGITAL_PIN_PDIDIS_70		0x00	/* P121	*/
#define DIGITAL_PIN_PDIDIS_71		0x00	/* P122	*/
#define DIGITAL_PIN_PDIDIS_72		0x00	/* P123	*/
#define DIGITAL_PIN_PDIDIS_73		0x00	/* P124	*/
#define DIGITAL_PIN_PDIDIS_74		0x00	/* P125	*/
#define DIGITAL_PIN_PDIDIS_75		0x00	/* P126	*/
#define DIGITAL_PIN_PDIDIS_76		0x00	/* P127	*/
#define DIGITAL_PIN_PDIDIS_77		0x00	/* P41	*/
#define DIGITAL_PIN_PDIDIS_78		0x20	/* P45	*/
#define DIGITAL_PIN_PDIDIS_79		0x00	/* P32	*/
#define DIGITAL_PIN_PDIDIS_80		0x00	/* P35	*/
#define DIGITAL_PIN_PDIDIS_81		0x00	/* P36	*/
#define DIGITAL_PIN_PDIDIS_82		0x00	/* P37	*/
#define DIGITAL_PIN_PDIDIS_83		0x01	/* P120	*/
#define DIGITAL_PIN_PDIDIS_84		0x00	/* P01	*/

#define DIGITAL_PIN_PDIDIS_85		0x00	/* P141	*/
#define DIGITAL_PIN_PDIDIS_86		0x04	/* P142	*/
#define DIGITAL_PIN_PDIDIS_87		0x00	/* P140	*/
#define DIGITAL_PIN_PDIDIS_88		0x01	/* P00	*/
#define DIGITAL_PIN_PDIDIS_89		0x00	/* P16	*/
#define DIGITAL_PIN_PDIDIS_90		0x00	/* P62	*/
#define DIGITAL_PIN_PDIDIS_91		0x00	/* P63	*/
#define DIGITAL_PIN_PDIDIS_92		0x00	/* P47	*/
#define DIGITAL_PIN_PDIDIS_93		0x00	/* P110	*/
#define DIGITAL_PIN_PDIDIS_94		0x10	/* P04	*/
#define DIGITAL_PIN_PDIDIS_95		0x00	/* P07	*/
#define DIGITAL_PIN_PDIDIS_96		0x20	/* P15	*/
#define DIGITAL_PIN_PDIDIS_97		0x08	/* P43	*/
#define DIGITAL_PIN_PDIDIS_98		0x10	/* P44	*/
#define DIGITAL_PIN_PDIDIS_99		0x00	/* P95	*/
#define DIGITAL_PIN_PDIDIS_100  	0x40	/* P96	*/
#define DIGITAL_PIN_PDIDIS_101  	0x00	/* P84	*/
#define DIGITAL_PIN_PDIDIS_102  	0x08	/* P83	*/
#define DIGITAL_PIN_PDIDIS_103  	0x00	/* P115	*/
#define DIGITAL_PIN_PDIDIS_104  	0x00	/* P116	*/
#define DIGITAL_PIN_PDIDIS_105  	0x00	/* P117	*/
#define DIGITAL_PIN_PDIDIS_106  	0x00	/* P147	*/
#define DIGITAL_PIN_PDIDIS_107  	0x00	/* P100	*/
#define DIGITAL_PIN_PDIDIS_108  	0x00	/* P156	*/
#define DIGITAL_PIN_PDIDIS_109  	0x00	/* P155	*/
#define DIGITAL_PIN_PDIDIS_110  	0x00	/* P154	*/
#define DIGITAL_PIN_PDIDIS_111  	0x00	/* P153	*/
#define DIGITAL_PIN_PDIDIS_112  	0x00	/* P152	*/
#define DIGITAL_PIN_PDIDIS_113  	0x00	/* P151	*/
#define DIGITAL_PIN_PDIDIS_114  	0x00	/* P150	*/
#define DIGITAL_PIN_PDIDIS_115  	0x00	/* P27	*/
#define DIGITAL_PIN_PDIDIS_116  	0x00	/* P26	*/
#define DIGITAL_PIN_PDIDIS_117  	0x00	/* P25	*/
#define DIGITAL_PIN_PDIDIS_118  	0x00	/* P24	*/


/* Define Digital Pin PM */
// except PM107, 123,124,157
// Px0 -> 001, Px1 -> 0x02, Px2 -> 0x04, Px3 -> 0x08, Px4 -> 0x10, Px5 -> 0x20, Px6 -> 0x40, Px7 -> 0x80

#define DIGITAL_PIN_PM_0		0x08	/* P33	*/
#define DIGITAL_PIN_PM_1		0x10	/* P34	*/
#define DIGITAL_PIN_PM_2		0x20	/* P145	*/
#define DIGITAL_PIN_PM_3		0x40	/* P106	*/
#define DIGITAL_PIN_PM_4		0x20	/* P105	*/
#define DIGITAL_PIN_PM_5		0x10	/* P104	*/
#define DIGITAL_PIN_PM_6		0x08	/* P103	*/
#define DIGITAL_PIN_PM_7		0x40	/* P46	*/
#define DIGITAL_PIN_PM_8		0x04	/* P42	*/
#define DIGITAL_PIN_PM_9		0x02	/* P31	*/
#define DIGITAL_PIN_PM_10		0x10	/* P64	*/
#define DIGITAL_PIN_PM_11		0x20	/* P65	*/
#define DIGITAL_PIN_PM_12		0x40	/* P66	*/
#define DIGITAL_PIN_PM_13		0x80	/* P67	*/
#define DIGITAL_PIN_PM_14		0x10	/* P144	*/
#define DIGITAL_PIN_PM_15		0x08	/* P143	*/
#define DIGITAL_PIN_PM_16		0x04	/* P02	*/
#define DIGITAL_PIN_PM_17		0x08	/* P03	*/
#define DIGITAL_PIN_PM_18		0x08	/* P13	*/
#define DIGITAL_PIN_PM_19		0x10	/* P14	*/
#define DIGITAL_PIN_PM_20		0x02	/* P61	*/
#define DIGITAL_PIN_PM_21		0x01	/* P60	*/
#define DIGITAL_PIN_PM_22		0x01	/* P40	*/
#define DIGITAL_PIN_PM_23		0x01	/* P80	*/
#define DIGITAL_PIN_PM_24		0x20	/* P05	*/
#define DIGITAL_PIN_PM_25		0x02	/* P81	*/
#define DIGITAL_PIN_PM_26		0x04	/* P82	*/
#define DIGITAL_PIN_PM_27		0x20	/* P85	*/
#define DIGITAL_PIN_PM_28		0x40	/* P86	*/
#define DIGITAL_PIN_PM_29		0x80	/* P87	*/
#define DIGITAL_PIN_PM_30		0x01	/* P30 	*/
#define DIGITAL_PIN_PM_31		0x01	/* P50	*/
#define DIGITAL_PIN_PM_32		0x02	/* P51	*/
#define DIGITAL_PIN_PM_33		0x04	/* P52	*/
#define DIGITAL_PIN_PM_34		0x08	/* P53	*/
#define DIGITAL_PIN_PM_35		0x10	/* P54	*/
#define DIGITAL_PIN_PM_36		0x20	/* P55	*/
#define DIGITAL_PIN_PM_37		0x40	/* P56	*/
#define DIGITAL_PIN_PM_38		0x80	/* P57	*/
#define DIGITAL_PIN_PM_39		0x80	/* P17	*/
#define DIGITAL_PIN_PM_40		0x04	/* P12	*/
#define DIGITAL_PIN_PM_41		0x02	/* P11 	*/
#define DIGITAL_PIN_PM_42		0x01	/* P10	*/
#define DIGITAL_PIN_PM_43		0x01	/* P90 	*/
#define DIGITAL_PIN_PM_44		0x02	/* P91 	*/
#define DIGITAL_PIN_PM_45		0x04	/* P92	*/
#define DIGITAL_PIN_PM_46		0x08	/* P93	*/
#define DIGITAL_PIN_PM_47		0x10	/* P94	*/
#define DIGITAL_PIN_PM_48		0x80	/* P97	*/
#define DIGITAL_PIN_PM_49		0x04	/* P112	*/
#define DIGITAL_PIN_PM_50		0x08	/* P113	*/
#define DIGITAL_PIN_PM_51		0x10	/* P114	*/
#define DIGITAL_PIN_PM_52		0x02	/* P101	*/
#define DIGITAL_PIN_PM_53		0x02	/* P111	*/
#define DIGITAL_PIN_PM_54		0x40	/* P146	*/
#define DIGITAL_PIN_PM_55		0x08	/* P23	*/
#define DIGITAL_PIN_PM_56		0x04	/* P22	*/
#define DIGITAL_PIN_PM_57		0x02	/* P21	*/
#define DIGITAL_PIN_PM_58		0x00	/* P130	*/
#define DIGITAL_PIN_PM_59		0x04	/* P102	*/
#define DIGITAL_PIN_PM_60		0x40	/* P06	*/
#define DIGITAL_PIN_PM_61		0x00	/* P137	*/
#define DIGITAL_PIN_PM_62		0x01	/* P70	*/
#define DIGITAL_PIN_PM_63		0x02	/* P71	*/
#define DIGITAL_PIN_PM_64		0x04	/* P72	*/
#define DIGITAL_PIN_PM_65		0x08	/* P73	*/
#define DIGITAL_PIN_PM_66		0x10	/* P74	*/
#define DIGITAL_PIN_PM_67		0x20	/* P75	*/
#define DIGITAL_PIN_PM_68		0x40	/* P76	*/
#define DIGITAL_PIN_PM_69		0x80	/* P77	*/
#define DIGITAL_PIN_PM_70		0x02	/* P121	*/
#define DIGITAL_PIN_PM_71		0x04	/* P122	*/
#define DIGITAL_PIN_PM_72		0x00	/* P123	*/
#define DIGITAL_PIN_PM_73		0x00	/* P124	*/
#define DIGITAL_PIN_PM_74		0x20	/* P125	*/
#define DIGITAL_PIN_PM_75		0x40	/* P126	*/
#define DIGITAL_PIN_PM_76		0x80	/* P127	*/
#define DIGITAL_PIN_PM_77		0x02	/* P41	*/
#define DIGITAL_PIN_PM_78		0x20	/* P45	*/
#define DIGITAL_PIN_PM_79		0x04	/* P32	*/
#define DIGITAL_PIN_PM_80		0x20	/* P35	*/
#define DIGITAL_PIN_PM_81		0x40	/* P36	*/
#define DIGITAL_PIN_PM_82		0x80	/* P37	*/
#define DIGITAL_PIN_PM_83		0x01	/* P120	*/
#define DIGITAL_PIN_PM_84		0x02	/* P01	*/

