renesas/ArduinoCore-rl78g23_fpb_128p/variants/g23-fpb-128p/pins_variant.h
#define DIGITAL_PIN_PM_85		0x02	/* P141	*/
#define DIGITAL_PIN_PM_86		0x04	/* P142	*/
#define DIGITAL_PIN_PM_87		0x01	/* P140	*/
#define DIGITAL_PIN_PM_88		0x01	/* P00	*/
#define DIGITAL_PIN_PM_89		0x40	/* P16	*/
#define DIGITAL_PIN_PM_90		0x04	/* P62	*/
#define DIGITAL_PIN_PM_91		0x08	/* P63	*/
#define DIGITAL_PIN_PM_92		0x80	/* P47	*/
#define DIGITAL_PIN_PM_93		0x01	/* P110	*/
#define DIGITAL_PIN_PM_94		0x10	/* P04	*/
#define DIGITAL_PIN_PM_95		0x80	/* P07	*/
#define DIGITAL_PIN_PM_96		0x20	/* P15	*/
#define DIGITAL_PIN_PM_97		0x08	/* P43	*/
#define DIGITAL_PIN_PM_98		0x10	/* P44	*/
#define DIGITAL_PIN_PM_99		0x20	/* P95	*/
#define DIGITAL_PIN_PM_100		0x40	/* P96	*/
#define DIGITAL_PIN_PM_101		0x10	/* P84	*/
#define DIGITAL_PIN_PM_102		0x08	/* P83	*/
#define DIGITAL_PIN_PM_103		0x20	/* P115	*/
#define DIGITAL_PIN_PM_104		0x40	/* P116	*/
#define DIGITAL_PIN_PM_105		0x80	/* P117	*/
#define DIGITAL_PIN_PM_106		0x80	/* P147	*/
#define DIGITAL_PIN_PM_107		0x01	/* P100	*/
#define DIGITAL_PIN_PM_108		0x40	/* P156	*/
#define DIGITAL_PIN_PM_109		0x20	/* P155	*/
#define DIGITAL_PIN_PM_110		0x10	/* P154	*/
#define DIGITAL_PIN_PM_111		0x08	/* P153	*/
#define DIGITAL_PIN_PM_112		0x04	/* P152	*/
#define DIGITAL_PIN_PM_113		0x02	/* P151	*/
#define DIGITAL_PIN_PM_114		0x01	/* P150	*/
#define DIGITAL_PIN_PM_115		0x80	/* P27	*/
#define DIGITAL_PIN_PM_116		0x40	/* P26	*/
#define DIGITAL_PIN_PM_117		0x20	/* P25	*/
#define DIGITAL_PIN_PM_118		0x10	/* P24	*/



/* Define Digital Pin PU */
#define DIGITAL_PIN_PU_0		0x08	/* P33	*/
#define DIGITAL_PIN_PU_1		0x10	/* P34	*/
#define DIGITAL_PIN_PU_2		0x20	/* P145	*/
#define DIGITAL_PIN_PU_3		0x40	/* P106	*/
#define DIGITAL_PIN_PU_4		0x20	/* P105	*/
#define DIGITAL_PIN_PU_5		0x10	/* P104	*/
#define DIGITAL_PIN_PU_6		0x08	/* P103	*/
#define DIGITAL_PIN_PU_7		0x40	/* P46	*/
#define DIGITAL_PIN_PU_8		0x04	/* P42	*/
#define DIGITAL_PIN_PU_9		0x02	/* P31	*/
#define DIGITAL_PIN_PU_10		0x10	/* P64	*/
#define DIGITAL_PIN_PU_11		0x20	/* P65	*/
#define DIGITAL_PIN_PU_12		0x40	/* P66	*/
#define DIGITAL_PIN_PU_13		0x80	/* P67	*/
#define DIGITAL_PIN_PU_14		0x10	/* P144	*/
#define DIGITAL_PIN_PU_15		0x08	/* P143	*/
#define DIGITAL_PIN_PU_16		0x04	/* P02	*/
#define DIGITAL_PIN_PU_17		0x08	/* P03	*/
#define DIGITAL_PIN_PU_18		0x08	/* P13	*/
#define DIGITAL_PIN_PU_19		0x10	/* P14	*/
#define DIGITAL_PIN_PU_20		0x00	/* P61	*/
#define DIGITAL_PIN_PU_21		0x00	/* P60	*/
#define DIGITAL_PIN_PU_22		0x01	/* P40	*/
#define DIGITAL_PIN_PU_23		0x01	/* P80	*/
#define DIGITAL_PIN_PU_24		0x20	/* P05	*/
#define DIGITAL_PIN_PU_25		0x02	/* P81	*/
#define DIGITAL_PIN_PU_26		0x04	/* P82	*/
#define DIGITAL_PIN_PU_27		0x20	/* P85	*/
#define DIGITAL_PIN_PU_28		0x40	/* P86	*/
#define DIGITAL_PIN_PU_29		0x80	/* P87	*/
#define DIGITAL_PIN_PU_30		0x01	/* P30 	*/
#define DIGITAL_PIN_PU_31		0x01	/* P50	*/
#define DIGITAL_PIN_PU_32		0x02	/* P51	*/
#define DIGITAL_PIN_PU_33		0x04	/* P52	*/
#define DIGITAL_PIN_PU_34		0x08	/* P53	*/
#define DIGITAL_PIN_PU_35		0x10	/* P54	*/
#define DIGITAL_PIN_PU_36		0x20	/* P55	*/
#define DIGITAL_PIN_PU_37		0x40	/* P56	*/
#define DIGITAL_PIN_PU_38		0x80	/* P57	*/
#define DIGITAL_PIN_PU_39		0x80	/* P17	*/
#define DIGITAL_PIN_PU_40		0x04	/* P12	*/
#define DIGITAL_PIN_PU_41		0x02	/* P11 	*/
#define DIGITAL_PIN_PU_42		0x01	/* P10	*/
#define DIGITAL_PIN_PU_43		0x01	/* P90 	*/
#define DIGITAL_PIN_PU_44		0x02	/* P91 	*/
#define DIGITAL_PIN_PU_45		0x04	/* P92	*/
#define DIGITAL_PIN_PU_46		0x08	/* P93	*/
#define DIGITAL_PIN_PU_47		0x10	/* P94	*/
#define DIGITAL_PIN_PU_48		0x80	/* P97	*/
#define DIGITAL_PIN_PU_49		0x04	/* P112	*/
#define DIGITAL_PIN_PU_50		0x08	/* P113	*/
#define DIGITAL_PIN_PU_51		0x10	/* P114	*/
#define DIGITAL_PIN_PU_52		0x02	/* P101	*/
#define DIGITAL_PIN_PU_53		0x02	/* P111	*/
#define DIGITAL_PIN_PU_54		0x40	/* P146	*/
#define DIGITAL_PIN_PU_55		0x00	/* P23	*/
#define DIGITAL_PIN_PU_56		0x00	/* P22	*/
#define DIGITAL_PIN_PU_57		0x00	/* P21	*/
#define DIGITAL_PIN_PU_58		0x00	/* P130	*/
#define DIGITAL_PIN_PU_59		0x04	/* P102	*/
#define DIGITAL_PIN_PU_60		0x40	/* P06	*/
#define DIGITAL_PIN_PU_61		0x00	/* P137	*/
#define DIGITAL_PIN_PU_62		0x01	/* P70	*/
#define DIGITAL_PIN_PU_63		0x02	/* P71	*/
#define DIGITAL_PIN_PU_64		0x04	/* P72	*/
#define DIGITAL_PIN_PU_65		0x08	/* P73	*/
#define DIGITAL_PIN_PU_66		0x10	/* P74	*/
#define DIGITAL_PIN_PU_67		0x20	/* P75	*/
#define DIGITAL_PIN_PU_68		0x40	/* P76	*/
#define DIGITAL_PIN_PU_69		0x80	/* P77	*/
#define DIGITAL_PIN_PU_70		0x02	/* P121	*/
#define DIGITAL_PIN_PU_71		0x04	/* P122	*/
#define DIGITAL_PIN_PU_72		0x00	/* P123	*/
#define DIGITAL_PIN_PU_73		0x00	/* P124	*/
#define DIGITAL_PIN_PU_74		0x20	/* P125	*/
#define DIGITAL_PIN_PU_75		0x40	/* P126	*/
#define DIGITAL_PIN_PU_76		0x80	/* P127	*/
#define DIGITAL_PIN_PU_77		0x02	/* P41	*/
#define DIGITAL_PIN_PU_78		0x20	/* P45	*/
#define DIGITAL_PIN_PU_79		0x04	/* P32	*/
#define DIGITAL_PIN_PU_80		0x20	/* P35	*/
#define DIGITAL_PIN_PU_81		0x40	/* P36	*/
#define DIGITAL_PIN_PU_82		0x80	/* P37	*/
#define DIGITAL_PIN_PU_83		0x01	/* P120	*/
#define DIGITAL_PIN_PU_84		0x02	/* P01	*/

#define DIGITAL_PIN_PU_85		0x02	/* P141	*/
#define DIGITAL_PIN_PU_86		0x04	/* P142	*/
#define DIGITAL_PIN_PU_87		0x01	/* P140	*/
#define DIGITAL_PIN_PU_88		0x01	/* P00	*/
#define DIGITAL_PIN_PU_89		0x40	/* P16	*/
#define DIGITAL_PIN_PU_90		0x00	/* P62	*/
#define DIGITAL_PIN_PU_91		0x00	/* P63	*/
#define DIGITAL_PIN_PU_92		0x80	/* P47	*/
#define DIGITAL_PIN_PU_93		0x01	/* P110	*/
#define DIGITAL_PIN_PU_94		0x10	/* P04	*/
#define DIGITAL_PIN_PU_95		0x80	/* P07	*/
#define DIGITAL_PIN_PU_96		0x20	/* P15	*/
#define DIGITAL_PIN_PU_97		0x08	/* P43	*/
#define DIGITAL_PIN_PU_98		0x10	/* P44	*/
#define DIGITAL_PIN_PU_99		0x20	/* P95	*/
#define DIGITAL_PIN_PU_100		0x40	/* P96	*/
#define DIGITAL_PIN_PU_101		0x10	/* P84	*/
#define DIGITAL_PIN_PU_102		0x08	/* P83	*/
#define DIGITAL_PIN_PU_103		0x20	/* P115	*/
#define DIGITAL_PIN_PU_104		0x40	/* P116	*/
#define DIGITAL_PIN_PU_105		0x80	/* P117	*/
#define DIGITAL_PIN_PU_106		0x80	/* P147	*/
#define DIGITAL_PIN_PU_107		0x01	/* P100	*/
#define DIGITAL_PIN_PU_108		0x00	/* P156	*/
#define DIGITAL_PIN_PU_109		0x00	/* P155	*/
#define DIGITAL_PIN_PU_110		0x00	/* P154	*/
#define DIGITAL_PIN_PU_111		0x00	/* P153	*/
#define DIGITAL_PIN_PU_112		0x00	/* P152	*/
#define DIGITAL_PIN_PU_113		0x00	/* P151	*/
#define DIGITAL_PIN_PU_114		0x00	/* P150	*/
#define DIGITAL_PIN_PU_115		0x00	/* P27	*/
#define DIGITAL_PIN_PU_116		0x00	/* P26	*/
#define DIGITAL_PIN_PU_117		0x00	/* P25	*/
#define DIGITAL_PIN_PU_118		0x00	/* P24	*/



/* Define Digital Pin PIM */
// only part of PIM0,1,3,4,5,7,8,14

#define DIGITAL_PIN_PIM_0		0x08	/* P33	*/
#define DIGITAL_PIN_PIM_1		0x00	/* P34	*/
#define DIGITAL_PIN_PIM_2		0x00	/* P145	*/
#define DIGITAL_PIN_PIM_3		0x00	/* P106	*/
#define DIGITAL_PIN_PIM_4		0x00	/* P105	*/
#define DIGITAL_PIN_PIM_5		0x00	/* P104	*/
#define DIGITAL_PIN_PIM_6		0x00	/* P103	*/
#define DIGITAL_PIN_PIM_7		0x00	/* P46	*/
#define DIGITAL_PIN_PIM_8		0x00	/* P42	*/
#define DIGITAL_PIN_PIM_9		0x00	/* P31	*/
#define DIGITAL_PIN_PIM_10		0x00	/* P64	*/
#define DIGITAL_PIN_PIM_11		0x00	/* P65	*/
#define DIGITAL_PIN_PIM_12		0x00	/* P66	*/
#define DIGITAL_PIN_PIM_13		0x00	/* P67	*/
#define DIGITAL_PIN_PIM_14		0x00	/* P144	*/
#define DIGITAL_PIN_PIM_15		0x08	/* P143	*/
#define DIGITAL_PIN_PIM_16		0x00	/* P02	*/
#define DIGITAL_PIN_PIM_17		0x08	/* P03	*/
#define DIGITAL_PIN_PIM_18		0x08	/* P13	*/
#define DIGITAL_PIN_PIM_19		0x10	/* P14	*/
#define DIGITAL_PIN_PIM_20		0x00	/* P61	*/
#define DIGITAL_PIN_PIM_21		0x00	/* P60	*/
#define DIGITAL_PIN_PIM_22		0x00	/* P40	*/
#define DIGITAL_PIN_PIM_23		0x01	/* P80	*/
#define DIGITAL_PIN_PIM_24		0x00	/* P05	*/
#define DIGITAL_PIN_PIM_25		0x02	/* P81	*/
#define DIGITAL_PIN_PIM_26		0x00	/* P82	*/
#define DIGITAL_PIN_PIM_27		0x00	/* P85	*/
#define DIGITAL_PIN_PIM_28		0x00	/* P86	*/
#define DIGITAL_PIN_PIM_29		0x00	/* P87	*/
#define DIGITAL_PIN_PIM_30		0x00	/* P30 	*/
#define DIGITAL_PIN_PIM_31		0x00	/* P50	*/
#define DIGITAL_PIN_PIM_32		0x00	/* P51	*/
#define DIGITAL_PIN_PIM_33		0x00	/* P52	*/
#define DIGITAL_PIN_PIM_34		0x08	/* P53	*/
#define DIGITAL_PIN_PIM_35		0x10	/* P54	*/
#define DIGITAL_PIN_PIM_36		0x20	/* P55	*/
#define DIGITAL_PIN_PIM_37		0x00	/* P56	*/
#define DIGITAL_PIN_PIM_38		0x00	/* P57	*/
#define DIGITAL_PIN_PIM_39		0x80	/* P17	*/
#define DIGITAL_PIN_PIM_40		0x00	/* P12	*/
#define DIGITAL_PIN_PIM_41		0x02	/* P11 	*/
#define DIGITAL_PIN_PIM_42		0x01	/* P10	*/
#define DIGITAL_PIN_PIM_43		0x00	/* P90 	*/
#define DIGITAL_PIN_PIM_44		0x00	/* P91 	*/
#define DIGITAL_PIN_PIM_45		0x00	/* P92	*/
#define DIGITAL_PIN_PIM_46		0x00	/* P93	*/
#define DIGITAL_PIN_PIM_47		0x00	/* P94	*/
#define DIGITAL_PIN_PIM_48		0x00	/* P97	*/
#define DIGITAL_PIN_PIM_49		0x00	/* P112	*/
#define DIGITAL_PIN_PIM_50		0x00	/* P113	*/
#define DIGITAL_PIN_PIM_51		0x00	/* P114	*/
#define DIGITAL_PIN_PIM_52		0x00	/* P101	*/
#define DIGITAL_PIN_PIM_53		0x00	/* P111	*/
#define DIGITAL_PIN_PIM_54		0x00	/* P146	*/
#define DIGITAL_PIN_PIM_55		0x00	/* P23	*/
#define DIGITAL_PIN_PIM_56		0x00	/* P22	*/
#define DIGITAL_PIN_PIM_57		0x00	/* P21	*/
#define DIGITAL_PIN_PIM_58		0x00	/* P130	*/
#define DIGITAL_PIN_PIM_59		0x00	/* P102	*/
#define DIGITAL_PIN_PIM_60		0x00	/* P06	*/
#define DIGITAL_PIN_PIM_61		0x00	/* P137	*/
#define DIGITAL_PIN_PIM_62		0x00	/* P70	*/
#define DIGITAL_PIN_PIM_63		0x02	/* P71	*/
#define DIGITAL_PIN_PIM_64		0x00	/* P72	*/
#define DIGITAL_PIN_PIM_65		0x00	/* P73	*/
#define DIGITAL_PIN_PIM_66		0x00	/* P74	*/
#define DIGITAL_PIN_PIM_67		0x00	/* P75	*/
#define DIGITAL_PIN_PIM_68		0x00	/* P76	*/
#define DIGITAL_PIN_PIM_69		0x00	/* P77	*/
#define DIGITAL_PIN_PIM_70		0x00	/* P121	*/
#define DIGITAL_PIN_PIM_71		0x00	/* P122	*/
#define DIGITAL_PIN_PIM_72		0x00	/* P123	*/
#define DIGITAL_PIN_PIM_73		0x00	/* P124	*/
#define DIGITAL_PIN_PIM_74		0x00	/* P125	*/
#define DIGITAL_PIN_PIM_75		0x00	/* P126	*/
#define DIGITAL_PIN_PIM_76		0x00	/* P127	*/
#define DIGITAL_PIN_PIM_77		0x02	/* P41	*/
#define DIGITAL_PIN_PIM_78		0x00	/* P45	*/
#define DIGITAL_PIN_PIM_79		0x00	/* P32	*/
#define DIGITAL_PIN_PIM_80		0x00	/* P35	*/
#define DIGITAL_PIN_PIM_81		0x00	/* P36	*/
#define DIGITAL_PIN_PIM_82		0x00	/* P37	*/
#define DIGITAL_PIN_PIM_83		0x00	/* P120	*/
#define DIGITAL_PIN_PIM_84		0x02	/* P01	*/

#define DIGITAL_PIN_PIM_85		0x00	/* P141	*/
#define DIGITAL_PIN_PIM_86		0x04	/* P142	*/
#define DIGITAL_PIN_PIM_87		0x00	/* P140	*/
#define DIGITAL_PIN_PIM_88		0x00	/* P00	*/
#define DIGITAL_PIN_PIM_89		0x40	/* P16	*/
#define DIGITAL_PIN_PIM_90		0x00	/* P62	*/
#define DIGITAL_PIN_PIM_91		0x00	/* P63	*/
#define DIGITAL_PIN_PIM_92		0x00	/* P47	*/
#define DIGITAL_PIN_PIM_93		0x00	/* P110	*/
#define DIGITAL_PIN_PIM_94		0x10	/* P04	*/
#define DIGITAL_PIN_PIM_95		0x00	/* P07	*/
#define DIGITAL_PIN_PIM_96		0x20	/* P15	*/
#define DIGITAL_PIN_PIM_97		0x08	/* P43	*/
#define DIGITAL_PIN_PIM_98		0x10	/* P44	*/
#define DIGITAL_PIN_PIM_99		0x00	/* P95	*/
#define DIGITAL_PIN_PIM_100		0x00	/* P96	*/
#define DIGITAL_PIN_PIM_101		0x10	/* P84	*/
#define DIGITAL_PIN_PIM_102		0x00	/* P83	*/
#define DIGITAL_PIN_PIM_103		0x00	/* P115	*/
#define DIGITAL_PIN_PIM_104		0x00	/* P116	*/
#define DIGITAL_PIN_PIM_105		0x00	/* P117	*/
#define DIGITAL_PIN_PIM_106		0x00	/* P147	*/
#define DIGITAL_PIN_PIM_107		0x00	/* P100	*/
#define DIGITAL_PIN_PIM_108		0x00	/* P156	*/
#define DIGITAL_PIN_PIM_109		0x00	/* P155	*/
#define DIGITAL_PIN_PIM_110		0x00	/* P154	*/
#define DIGITAL_PIN_PIM_111		0x00	/* P153	*/
#define DIGITAL_PIN_PIM_112		0x00	/* P152	*/
#define DIGITAL_PIN_PIM_113		0x00	/* P151	*/
#define DIGITAL_PIN_PIM_114		0x00	/* P150	*/
#define DIGITAL_PIN_PIM_115		0x00	/* P27	*/
#define DIGITAL_PIN_PIM_116		0x00	/* P26	*/
#define DIGITAL_PIN_PIM_117		0x00	/* P25	*/
#define DIGITAL_PIN_PIM_118		0x00	/* P24	*/


/* Define Digital Pin POM */

#define DIGITAL_PIN_POM_0		0x00	/* P33	*/
#define DIGITAL_PIN_POM_1		0x10	/* P34	*/
#define DIGITAL_PIN_POM_2		0x00	/* P145	*/
#define DIGITAL_PIN_POM_3		0x00	/* P106	*/
#define DIGITAL_PIN_POM_4		0x00	/* P105	*/
#define DIGITAL_PIN_POM_5		0x00	/* P104	*/
#define DIGITAL_PIN_POM_6		0x00	/* P103	*/
#define DIGITAL_PIN_POM_7		0x00	/* P46	*/
#define DIGITAL_PIN_POM_8		0x04	/* P42	*/
#define DIGITAL_PIN_POM_9		0x00	/* P31	*/
#define DIGITAL_PIN_POM_10		0x00	/* P64	*/
#define DIGITAL_PIN_POM_11		0x00	/* P65	*/
#define DIGITAL_PIN_POM_12		0x00	/* P66	*/
#define DIGITAL_PIN_POM_13		0x00	/* P67	*/
#define DIGITAL_PIN_POM_14		0x10	/* P144	*/
#define DIGITAL_PIN_POM_15		0x08	/* P143	*/
#define DIGITAL_PIN_POM_16		0x04	/* P02	*/
#define DIGITAL_PIN_POM_17		0x08	/* P03	*/
#define DIGITAL_PIN_POM_18		0x08	/* P13	*/
#define DIGITAL_PIN_POM_19		0x10	/* P14	*/
#define DIGITAL_PIN_POM_20		0x00	/* P61	*/
#define DIGITAL_PIN_POM_21		0x00	/* P60	*/
#define DIGITAL_PIN_POM_22		0x00	/* P40	*/
#define DIGITAL_PIN_POM_23		0x01	/* P80	*/
#define DIGITAL_PIN_POM_24		0x00	/* P05	*/
#define DIGITAL_PIN_POM_25		0x02	/* P81	*/
#define DIGITAL_PIN_POM_26		0x04	/* P82	*/
#define DIGITAL_PIN_POM_27		0x00	/* P85	*/
#define DIGITAL_PIN_POM_28		0x00	/* P86	*/
#define DIGITAL_PIN_POM_29		0x00	/* P87	*/
#define DIGITAL_PIN_POM_30		0x00	/* P30 	*/
#define DIGITAL_PIN_POM_31		0x01	/* P50	*/
#define DIGITAL_PIN_POM_32		0x00	/* P51	*/
#define DIGITAL_PIN_POM_33		0x04	/* P52	*/
#define DIGITAL_PIN_POM_34		0x08	/* P53	*/
#define DIGITAL_PIN_POM_35		0x10	/* P54	*/
#define DIGITAL_PIN_POM_36		0x20	/* P55	*/
#define DIGITAL_PIN_POM_37		0x00	/* P56	*/
#define DIGITAL_PIN_POM_38		0x00	/* P57	*/
#define DIGITAL_PIN_POM_39		0x80	/* P17	*/
#define DIGITAL_PIN_POM_40		0x04	/* P12	*/
#define DIGITAL_PIN_POM_41		0x02	/* P11 	*/
#define DIGITAL_PIN_POM_42		0x01	/* P10	*/
#define DIGITAL_PIN_POM_43		0x00	/* P90 	*/
#define DIGITAL_PIN_POM_44		0x00	/* P91 	*/
#define DIGITAL_PIN_POM_45		0x00	/* P92	*/
#define DIGITAL_PIN_POM_46		0x00	/* P93	*/
#define DIGITAL_PIN_POM_47		0x00	/* P94	*/
#define DIGITAL_PIN_POM_48		0x00	/* P97	*/
#define DIGITAL_PIN_POM_49		0x00	/* P112	*/
#define DIGITAL_PIN_POM_50		0x00	/* P113	*/
#define DIGITAL_PIN_POM_51		0x00	/* P114	*/
#define DIGITAL_PIN_POM_52		0x00	/* P101	*/
#define DIGITAL_PIN_POM_53		0x00	/* P111	*/
#define DIGITAL_PIN_POM_54		0x00	/* P146	*/
#define DIGITAL_PIN_POM_55		0x00	/* P23	*/
#define DIGITAL_PIN_POM_56		0x00	/* P22	*/
#define DIGITAL_PIN_POM_57		0x00	/* P21	*/
#define DIGITAL_PIN_POM_58		0x00	/* P130	*/
#define DIGITAL_PIN_POM_59		0x00	/* P102	*/
#define DIGITAL_PIN_POM_60		0x00	/* P06	*/
#define DIGITAL_PIN_POM_61		0x00	/* P137	*/
#define DIGITAL_PIN_POM_62		0x00	/* P70	*/
#define DIGITAL_PIN_POM_63		0x02	/* P71	*/
#define DIGITAL_PIN_POM_64		0x04	/* P72	*/
#define DIGITAL_PIN_POM_65		0x00	/* P73	*/
#define DIGITAL_PIN_POM_66		0x10	/* P74	*/
#define DIGITAL_PIN_POM_67		0x00	/* P75	*/
#define DIGITAL_PIN_POM_68		0x00	/* P76	*/
#define DIGITAL_PIN_POM_69		0x00	/* P77	*/
#define DIGITAL_PIN_POM_70		0x00	/* P121	*/
#define DIGITAL_PIN_POM_71		0x00	/* P122	*/
#define DIGITAL_PIN_POM_72		0x00	/* P123	*/
#define DIGITAL_PIN_POM_73		0x00	/* P124	*/
#define DIGITAL_PIN_POM_74		0x00	/* P125	*/
#define DIGITAL_PIN_POM_75		0x00	/* P126	*/
#define DIGITAL_PIN_POM_76		0x00	/* P127	*/
#define DIGITAL_PIN_POM_77		0x00	/* P41	*/
#define DIGITAL_PIN_POM_78		0x20	/* P45	*/
#define DIGITAL_PIN_POM_79		0x00	/* P32	*/
#define DIGITAL_PIN_POM_80		0x00	/* P35	*/
#define DIGITAL_PIN_POM_81		0x00	/* P36	*/
#define DIGITAL_PIN_POM_82		0x00	/* P37	*/
#define DIGITAL_PIN_POM_83		0x01	/* P120	*/
#define DIGITAL_PIN_POM_84		0x00	/* P01	*/

#define DIGITAL_PIN_POM_85		0x00	/* P141	*/
#define DIGITAL_PIN_POM_86		0x04	/* P142	*/
#define DIGITAL_PIN_POM_87		0x00	/* P140	*/
#define DIGITAL_PIN_POM_88		0x01	/* P00	*/
#define DIGITAL_PIN_POM_89		0x00	/* P16	*/
#define DIGITAL_PIN_POM_90		0x00	/* P62	*/
#define DIGITAL_PIN_POM_91		0x00	/* P63	*/
#define DIGITAL_PIN_POM_92		0x00	/* P47	*/
#define DIGITAL_PIN_POM_93		0x00	/* P110	*/
#define DIGITAL_PIN_POM_94		0x10	/* P04	*/
#define DIGITAL_PIN_POM_95		0x00	/* P07	*/
#define DIGITAL_PIN_POM_96		0x20	/* P15	*/
#define DIGITAL_PIN_POM_97		0x08	/* P43	*/
#define DIGITAL_PIN_POM_98		0x10	/* P44	*/
#define DIGITAL_PIN_POM_99		0x00	/* P95	*/
#define DIGITAL_PIN_POM_100		0x40	/* P96	*/
#define DIGITAL_PIN_POM_101		0x00	/* P84	*/
#define DIGITAL_PIN_POM_102		0x08	/* P83	*/
#define DIGITAL_PIN_POM_103		0x00	/* P115	*/
#define DIGITAL_PIN_POM_104		0x00	/* P116	*/
#define DIGITAL_PIN_POM_105		0x00	/* P117	*/
#define DIGITAL_PIN_POM_106		0x00	/* P147	*/
#define DIGITAL_PIN_POM_107		0x00	/* P100	*/
#define DIGITAL_PIN_POM_108		0x00	/* P156	*/
#define DIGITAL_PIN_POM_109		0x00	/* P155	*/
#define DIGITAL_PIN_POM_110		0x00	/* P154	*/
#define DIGITAL_PIN_POM_111		0x00	/* P153	*/
#define DIGITAL_PIN_POM_112		0x00	/* P152	*/
#define DIGITAL_PIN_POM_113		0x00	/* P151	*/
#define DIGITAL_PIN_POM_114		0x00	/* P150	*/
#define DIGITAL_PIN_POM_115		0x00	/* P27	*/
#define DIGITAL_PIN_POM_116		0x00	/* P26	*/
#define DIGITAL_PIN_POM_117		0x00	/* P25	*/
#define DIGITAL_PIN_POM_118		0x00	/* P24	*/

#define SWPWM_PIN			0xE0

//
#define TONE_PIN_2			2		// TO7
#define TONE_PIN_7			7		// TO5
#define TONE_PIN_8			8		// TO4
#define TONE_PIN_9			9		// TO3
#define TONE_PIN_39			39		// TO2
#define TONE_PIN_59			59		// TO6

