renesas/ArduinoCore-rl78g23_fpb_128p/variants/g23-fpb-128p/pins_variant.h
#define TONE_PIN_10			10		// T1O
#define TONE_PIN_11			11		// T11
#define TONE_PIN_12			12		// T12
#define TONE_PIN_13			13		// T13
#define TONE_PIN_6			6		// T14
#define TONE_PIN_5			5		// T15
#define TONE_PIN_4			4		// T16
#define TONE_PIN_3			3		// T17

#define PWM_PIN_22			0xE1	// Software PWM1
#define PWM_PIN_23			0xE2	// Software PWM2
#define PWM_PIN_24			0xE3	// Software PWM3
#define SWPWM_PIN			0xE0

#define PWM_PIN_2			2		// TO7
#define PWM_PIN_3			3	    // TO17
#define PWM_PIN_4			4	    // TO16
#define PWM_PIN_5			5	    // TO15
#define PWM_PIN_6			6		// TO14
#define PWM_PIN_7			7		// TO5
#define PWM_PIN_8           8       //TO04
#define PWM_PIN_9			9		// TO3   (1)
#define PWM_PIN_10			10	    // TO10
#define PWM_PIN_11			11	    // TO11
#define PWM_PIN_12			12	    // TO11
#define PWM_PIN_13			13	    // TO13

/* Define Serial Port Number */
#define SERIAL_TXD0			40 // P12
#define SERIAL_RXD0			41 // P11
#define SERIAL_TXD1			1  // P34 TxDA1
#define SERIAL_RXD1			0  // P33
#define SERIAL_TXD2			18 // P13 TxD2
#define SERIAL_RXD2			19 // P14
#define SERIAL_TXD3			16 // P02 TxD1
#define SERIAL_RXD3			17 // P03
#define SERIAL_TXD4			14 // P144 TxD3
#define SERIAL_RXD4			15 // P143

/* Define Firmata library */
#define TOTAL_ANALOG_PINS       NUM_ANALOG_INPUTS
#define TOTAL_PINS              NUM_DIGITAL_PINS // 14 digital + 6 analog + 6 reserved + 10 internal used + 2 I2C + 3 SPI
#define TOTAL_PORTS             15 //P00 - P147
#define VERSION_BLINK_PIN       BUILTIN_LED1
/* for FIRMATA specific for G23(128p) */
#define PIN_SERIAL0_RX         41
#define PIN_SERIAL0_TX         40
#define PIN_SERIAL1_RX          0
#define PIN_SERIAL1_TX          1
#define PIN_SERIAL2_RX         19
#define PIN_SERIAL2_TX         18
#define PIN_SERIAL3_RX         17
#define PIN_SERIAL3_TX         16
#define PIN_SERIAL4_RX         15
#define PIN_SERIAL4_TX         14

#if defined(UART_CHANNEL)
#define IS_PIN_SERIAL0(p)        ((p) == PIN_SERIAL0_RX || (p) == PIN_SERIAL0_TX )
#else
#define IS_PIN_SERIAL0(p)        (0)
#endif
#if defined(UART1_CHANNEL)
#define IS_PIN_SERIAL1(p)        ((p) == PIN_SERIAL1_RX || (p) == PIN_SERIAL1_TX)
#else
#define IS_PIN_SERIAL1(p)        (0)
#endif
#if defined(UART2_CHANNEL)
#define IS_PIN_SERIAL2(p)        ((p) == PIN_SERIAL2_RX || (p) == PIN_SERIAL2_TX)
#else
#define IS_PIN_SERIAL2(p)        (0)
#endif
#if defined(UART3_CHANNEL)
#define IS_PIN_SERIAL3(p)        ((p) == PIN_SERIAL3_RX || (p) == PIN_SERIAL3_TX)
#else
#define IS_PIN_SERIAL3(p)        (0)
#endif
#if defined(UART4_CHANNEL)
#define IS_PIN_SERIAL4(p)        ((p) == PIN_SERIAL4_RX || (p) == PIN_SERIAL4_TX)
#else
#define IS_PIN_SERIAL4(p)        (0)
#endif

#define IS_PIN_DIGITAL(p)       ((p) >= 0 && (p) < NUM_DIGITAL_PINS && (!(IS_PIN_SERIAL(p))) && !((p) == 22) && !((p) == 24) && !((p) == 30) && !((p) == 57)  && !((p) == 60) && !((p) == 72) && !((p) == 73) )

#define IS_PIN_ANALOG(p)        ((p) >= 103 && (p) < 119)
#define IS_PIN_PWM(p)           digitalPinHasPWM(p)
#define IS_PIN_SERVO(p)         ((p) >= 0 && (p) < MAX_SERVOS)
#define IS_PIN_I2C(p)           ((p) == PIN_WIRE_SDA0 || (p) == PIN_WIRE_SCL0 || (p) == PIN_WIRE_SDA1 || (p) == PIN_WIRE_SCL1)
#define IS_PIN_SPI(p)           ((p) == SS || (p) == MOSI || (p) == MISO || (p) == SCK)

#define IS_PIN_SERIAL(p)        (IS_PIN_SERIAL0(p) || IS_PIN_SERIAL1(p) || IS_PIN_SERIAL2(p) || IS_PIN_SERIAL3(p) || IS_PIN_SERIAL4(p))
#define PIN_TO_DIGITAL(p)       (p)
#define PIN_TO_ANALOG(p)        ((p) - 103)
#define PIN_TO_PWM(p)           PIN_TO_DIGITAL(p)
#define PIN_TO_SERVO(p)         (p)
#define ANALOG_TO_PIN(p)        ((p) + 103)
/* Define Firmata library */

#endif // #variant
